qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
    struct {
      __IOM uint32_t SQR0       : 4;            /*!< [3..0] desc SQR0                                                          */
      __IOM uint32_t SQR1       : 4;            /*!< [7..4] desc SQR1                                                          */
      __IOM uint32_t SQR2       : 4;            /*!< [11..8] desc SQR2                                                         */
      __IOM uint32_t SQR3       : 4;            /*!< [15..12] desc SQR3                                                        */
      __IOM uint32_t ENS        : 3;            /*!< [18..16] desc ENS                                                         */
      __IM  uint32_t            : 13;
    } SQR0_f;
  } ;
  
  union {
    __IOM uint32_t SQR1;                        /*!< (@ 0x00000054) desc SQR1                                                  */
    
    struct {
      __IOM uint32_t SQR4       : 4;            /*!< [3..0] desc SQR4                                                          */
      __IOM uint32_t SQR5       : 4;            /*!< [7..4] desc SQR5                                                          */
      __IOM uint32_t SQR6       : 4;            /*!< [11..8] desc SQR6                                                         */
      __IOM uint32_t SQR7       : 4;            /*!< [15..12] desc SQR7                                                        */
      __IM  uint32_t            : 16;
    } SQR1_f;
  } ;
} ADC_TypeDef;                                     /*!< Size = 88 (0x58)                                                          */



/* =========================================================================================================================== */
/* ================                                            AES                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc AES (AES)
  */

typedef struct {                                /*!< (@ 0x40026000) AES Structure                                              */
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) desc CR                                                    */
    
    struct {
      __IOM uint32_t START      : 1;            /*!< [0..0] desc START                                                         */
      __IOM uint32_t MODE       : 1;            /*!< [1..1] desc MODE                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t KEYSIZE    : 2;            /*!< [4..3] desc KEYSIZE                                                       */
      __IM  uint32_t            : 27;
    } CR_f;
  } ;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t DATA0;                       /*!< (@ 0x00000010) desc DATA0                                                 */
    
    struct {
      __IOM uint32_t DATA0      : 32;           /*!< [31..0] desc DATA0                                                        */
    } DATA0_f;
  } ;
  
  union {
    __IOM uint32_t DATA1;                       /*!< (@ 0x00000014) desc DATA1                                                 */
    
    struct {
      __IOM uint32_t DATA1      : 32;           /*!< [31..0] desc DATA1                                                        */
    } DATA1_f;
  } ;
  
  union {
    __IOM uint32_t DATA2;                       /*!< (@ 0x00000018) desc DATA2                                                 */
    
    struct {
      __IOM uint32_t DATA2      : 32;           /*!< [31..0] desc DATA2                                                        */
    } DATA2_f;
  } ;
  
  union {
    __IOM uint32_t DATA3;                       /*!< (@ 0x0000001C) desc DATA3                                                 */
    
    struct {
      __IOM uint32_t DATA3      : 32;           /*!< [31..0] desc DATA3                                                        */
    } DATA3_f;
  } ;
  
  union {
    __OM  uint32_t KEY0;                        /*!< (@ 0x00000020) desc KEY0                                                  */
    
    struct {
      __OM  uint32_t KEY0       : 32;           /*!< [31..0] desc KEY0                                                         */
    } KEY0_f;
  } ;
  
  union {
    __OM  uint32_t KEY1;                        /*!< (@ 0x00000024) desc KEY1                                                  */
    
    struct {
      __OM  uint32_t KEY1       : 32;           /*!< [31..0] desc KEY1                                                         */
    } KEY1_f;
  } ;
  
  union {
    __OM  uint32_t KEY2;                        /*!< (@ 0x00000028) desc KEY2                                                  */
    
    struct {
      __OM  uint32_t KEY2       : 32;           /*!< [31..0] desc KEY2                                                         */
    } KEY2_f;
  } ;
  
  union {
    __OM  uint32_t KEY3;                        /*!< (@ 0x0000002C) desc KEY3                                                  */
    
    struct {
      __OM  uint32_t KEY3       : 32;           /*!< [31..0] desc KEY3                                                         */
    } KEY3_f;
  } ;
  
  union {
    __OM  uint32_t KEY4;                        /*!< (@ 0x00000030) desc KEY4                                                  */
    
    struct {
      __OM  uint32_t KEY4       : 32;           /*!< [31..0] desc KEY4                                                         */
    } KEY4_f;
  } ;
  
  union {
    __OM  uint32_t KEY5;                        /*!< (@ 0x00000034) desc KEY5                                                  */
    
    struct {
      __OM  uint32_t KEY5       : 32;           /*!< [31..0] desc KEY5                                                         */
    } KEY5_f;
  } ;
  
  union {
    __OM  uint32_t KEY6;                        /*!< (@ 0x00000038) desc KEY6                                                  */
    
