qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
    struct {
      __OM  uint32_t KEY6       : 32;           /*!< [31..0] desc KEY6                                                         */
    } KEY6_f;
  } ;
  
  union {
    __OM  uint32_t KEY7;                        /*!< (@ 0x0000003C) desc KEY7                                                  */
    
    struct {
      __OM  uint32_t KEY7       : 32;           /*!< [31..0] desc KEY7                                                         */
    } KEY7_f;
  } ;
} AES_TypeDef;                                     /*!< Size = 64 (0x40)                                                          */



/* =========================================================================================================================== */
/* ================                                           ATIM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc ATIM (ATIM)
  */

typedef struct {                                /*!< (@ 0x40012C00) ATIM Structure                                             */
  
  union {
    __IOM uint32_t ARR;                         /*!< (@ 0x00000000) desc ARR                                                   */
    
    struct {
      __IOM uint32_t ARR        : 16;           /*!< [15..0] desc ARR                                                          */
      __IM  uint32_t            : 16;
    } ARR_f;
  } ;
  
  union {
    __IOM uint32_t CNT;                         /*!< (@ 0x00000004) desc CNT                                                   */
    
    struct {
      __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
      __IM  uint32_t            : 16;
    } CNT_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x0000000C) desc CR                                                    */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t COMP       : 1;            /*!< [1..1] desc COMP                                                          */
      __IOM uint32_t CT         : 1;            /*!< [2..2] desc CT                                                            */
      __IOM uint32_t PWM2S      : 1;            /*!< [3..3] desc PWM2S                                                         */
      __IOM uint32_t PRS        : 3;            /*!< [6..4] desc PRS                                                           */
      __IOM uint32_t BUFPEN     : 1;            /*!< [7..7] desc BUFPEN                                                        */
      __IM  uint32_t            : 2;
      __IOM uint32_t UIE        : 1;            /*!< [10..10] desc UIE                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t MODE       : 2;            /*!< [13..12] Please keep 10/11                                                */
      __IOM uint32_t ONESHOT    : 1;            /*!< [14..14] desc ONESHOT                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t OCCS       : 1;            /*!< [16..16] desc OCCS                                                        */
      __IOM uint32_t URS        : 1;            /*!< [17..17] desc URS                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t TIE        : 1;            /*!< [19..19] desc TIE                                                         */
      __IOM uint32_t BIE        : 1;            /*!< [20..20] desc BIE                                                         */
      __IOM uint32_t CISA       : 2;            /*!< [22..21] desc CISA                                                        */
      __IOM uint32_t OCCE       : 1;            /*!< [23..23] desc OCCE                                                        */
      __IOM uint32_t TG         : 1;            /*!< [24..24] desc TG                                                          */
      __IOM uint32_t UG         : 1;            /*!< [25..25] desc UG                                                          */
      __IOM uint32_t BG         : 1;            /*!< [26..26] desc BG                                                          */
      __IOM uint32_t DIR        : 1;            /*!< [27..27] desc DIR                                                         */
      __IOM uint32_t OVE        : 1;            /*!< [28..28] desc OVE                                                         */
      __IOM uint32_t UNDE       : 1;            /*!< [29..29] desc UNDE                                                        */
      __IM  uint32_t            : 2;
    } CR_f;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x00000010) desc ISR                                                   */
    
    struct {
      __IM  uint32_t UIF        : 1;            /*!< [0..0] desc UIF                                                           */
      __IM  uint32_t            : 1;
      __IM  uint32_t C1AF       : 1;            /*!< [2..2] desc C1AF                                                          */
      __IM  uint32_t C2AF       : 1;            /*!< [3..3] desc C2AF                                                          */
      __IM  uint32_t C3AF       : 1;            /*!< [4..4] desc C3AF                                                          */
      __IM  uint32_t C1BF       : 1;            /*!< [5..5] desc C1BF                                                          */
      __IM  uint32_t C2BF       : 1;            /*!< [6..6] desc C2BF                                                          */
      __IM  uint32_t C3BF       : 1;            /*!< [7..7] desc C3BF                                                          */
      __IM  uint32_t C1AE       : 1;            /*!< [8..8] desc C1AE                                                          */
      __IM  uint32_t C2AE       : 1;            /*!< [9..9] desc C2AE                                                          */
      __IM  uint32_t C3AE       : 1;            /*!< [10..10] desc C3AE                                                        */
      __IM  uint32_t C1BE       : 1;            /*!< [11..11] desc C1BE                                                        */
      __IM  uint32_t C2BE       : 1;            /*!< [12..12] desc C2BE                                                        */
      __IM  uint32_t C3BE       : 1;            /*!< [13..13] desc C3BE                                                        */
      __IM  uint32_t BIF        : 1;            /*!< [14..14] desc BIF                                                         */
      __IM  uint32_t TIF        : 1;            /*!< [15..15] desc TIF                                                         */
      __IM  uint32_t OVF        : 1;            /*!< [16..16] desc OVF                                                         */
      __IM  uint32_t UNDF       : 1;            /*!< [17..17] desc UNDF                                                        */
      __IM  uint32_t C4AF       : 1;            /*!< [18..18] desc C4AF                                                        */
      __IM  uint32_t            : 13;
    } ISR_f;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000014) desc ICR                                                   */
    
