qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
    struct {
      __IM  uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
      __IM  uint32_t            : 16;
    } CNT_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000010) desc IER                                                   */
    
    struct {
      __IOM uint32_t END        : 1;            /*!< [0..0] desc END                                                           */
      __IOM uint32_t OK         : 1;            /*!< [1..1] desc OK                                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t UD         : 1;            /*!< [3..3] desc UD                                                            */
      __IOM uint32_t OV         : 1;            /*!< [4..4] desc OV                                                            */
      __IOM uint32_t MISS       : 1;            /*!< [5..5] desc MISS                                                          */
      __IM  uint32_t            : 26;
    } IER_f;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x00000014) desc ISR                                                   */
    
    struct {
      __IM  uint32_t END        : 1;            /*!< [0..0] desc END                                                           */
      __IM  uint32_t OK         : 1;            /*!< [1..1] desc OK                                                            */
      __IM  uint32_t            : 1;
      __IM  uint32_t UD         : 1;            /*!< [3..3] desc UD                                                            */
      __IM  uint32_t OV         : 1;            /*!< [4..4] desc OV                                                            */
      __IM  uint32_t MISS       : 1;            /*!< [5..5] desc MISS                                                          */
      __IM  uint32_t            : 26;
    } ISR_f;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x0000001C) desc ICR                                                   */
    
    struct {
      __IOM uint32_t END        : 1;            /*!< [0..0] desc END                                                           */
      __IOM uint32_t OK         : 1;            /*!< [1..1] desc OK                                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t UD         : 1;            /*!< [3..3] desc UD                                                            */
      __IOM uint32_t OV         : 1;            /*!< [4..4] desc OV                                                            */
      __IOM uint32_t MISS       : 1;            /*!< [5..5] desc MISS                                                          */
      __IM  uint32_t            : 26;
    } ICR_f;
  } ;
  __IM  uint32_t  RESERVED2[24];
  
  union {
    __IOM uint32_t FCAP;                        /*!< (@ 0x00000080) desc FCAP                                                  */
    
    struct {
      __IM  uint32_t FCAP       : 16;           /*!< [15..0] desc FCAP                                                         */
      __IM  uint32_t            : 16;
    } FCAP_f;
  } ;
  
  union {
    __IOM uint32_t TVAL;                        /*!< (@ 0x00000084) desc TVAL                                                  */
    
    struct {
      __IM  uint32_t TVAL       : 16;           /*!< [15..0] desc TVAL                                                         */
      __IM  uint32_t            : 16;
    } TVAL_f;
  } ;
  
  union {
    __IOM uint32_t FLIM;                        /*!< (@ 0x00000088) desc FLIM                                                  */
    
    struct {
      __IM  uint32_t FLIM       : 16;           /*!< [15..0] desc FLIM                                                         */
      __IM  uint32_t            : 16;
    } FLIM_f;
  } ;
} AUTOTRIM_TypeDef;                                     /*!< Size = 140 (0x8c)                                                          */



/* =========================================================================================================================== */
/* ================                                           BTIM1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief desc BTIM1 (BTIM1)
  */

typedef struct {                                /*!< (@ 0x40014800) BTIM1 Structure                                            */
  
  union {
    __IOM uint32_t ARR;                         /*!< (@ 0x00000000) desc ARR                                                   */
    
    struct {
      __IOM uint32_t ARR        : 16;           /*!< [15..0] desc ARR                                                          */
      __IM  uint32_t            : 16;
    } ARR_f;
  } ;
  
  union {
    __IOM uint32_t CNT;                         /*!< (@ 0x00000004) desc CNT                                                   */
    
    struct {
      __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
      __IM  uint32_t            : 16;
    } CNT_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t ACR;                         /*!< (@ 0x0000000C) desc ACR                                                   */
    
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t ETRFLT     : 3;            /*!< [6..4] desc ETRFLT                                                        */
      __IM  uint32_t            : 25;
    } ACR_f;
  } ;
  
  union {
    __IOM uint32_t BCR;                         /*!< (@ 0x00000010) desc BCR                                                   */
    
