qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
    struct {
      __IOM uint32_t LOCK16     : 1;            /*!< [0..0] Page128 - 135                                                      */
      __IOM uint32_t LOCK17     : 1;            /*!< [1..1] Page136 - 143                                                      */
      __IOM uint32_t LOCK18     : 1;            /*!< [2..2] Page144 - 151                                                      */
      __IOM uint32_t LOCK19     : 1;            /*!< [3..3] Page152 - 159                                                      */
      __IOM uint32_t LOCK20     : 1;            /*!< [4..4] Page160 - 167                                                      */
      __IOM uint32_t LOCK21     : 1;            /*!< [5..5] Page168 - 175                                                      */
      __IOM uint32_t LOCK22     : 1;            /*!< [6..6] Page176 - 183                                                      */
      __IOM uint32_t LOCK23     : 1;            /*!< [7..7] Page184 - 191                                                      */
      __IOM uint32_t LOCK24     : 1;            /*!< [8..8] Page192 - 199                                                      */
      __IOM uint32_t LOCK25     : 1;            /*!< [9..9] Page200 - 207                                                      */
      __IOM uint32_t LOCK26     : 1;            /*!< [10..10] Page208 - 215                                                    */
      __IOM uint32_t LOCK27     : 1;            /*!< [11..11] Page216 - 223                                                    */
      __IOM uint32_t LOCK28     : 1;            /*!< [12..12] Page224 - 231                                                    */
      __IOM uint32_t LOCK29     : 1;            /*!< [13..13] Page232 - 239                                                    */
      __IOM uint32_t LOCK30     : 1;            /*!< [14..14] Page240 - 247                                                    */
      __IOM uint32_t LOCK31     : 1;            /*!< [15..15] Page248 - 255                                                    */
      __OM  uint32_t KEY        : 16;           /*!< [31..16] desc KEY                                                         */
    } PAGELOCK2_f;
  } ;
  
  union {
    __IOM uint32_t PAGELOCK3;                   /*!< (@ 0x00000010) desc PAGELOCK3                                             */
    
    struct {
      __IOM uint32_t LOCK32     : 1;            /*!< [0..0] Page256 - 263                                                      */
      __IOM uint32_t LOCK33     : 1;            /*!< [1..1] Page264 - 271                                                      */
      __IOM uint32_t LOCK34     : 1;            /*!< [2..2] Page272 - 279                                                      */
      __IOM uint32_t LOCK35     : 1;            /*!< [3..3] Page280 - 287                                                      */
      __IOM uint32_t LOCK36     : 1;            /*!< [4..4] Page288 - 295                                                      */
      __IOM uint32_t LOCK37     : 1;            /*!< [5..5] Page296 - 303                                                      */
      __IOM uint32_t LOCK38     : 1;            /*!< [6..6] Page304 - 311                                                      */
      __IOM uint32_t LOCK39     : 1;            /*!< [7..7] Page312 - 319                                                      */
      __IOM uint32_t LOCK40     : 1;            /*!< [8..8] Page320 - 327                                                      */
      __IOM uint32_t LOCK41     : 1;            /*!< [9..9] Page328 - 335                                                      */
      __IOM uint32_t LOCK42     : 1;            /*!< [10..10] Page336 - 343                                                    */
      __IOM uint32_t LOCK43     : 1;            /*!< [11..11] Page344 - 351                                                    */
      __IOM uint32_t LOCK44     : 1;            /*!< [12..12] Page352 - 359                                                    */
      __IOM uint32_t LOCK45     : 1;            /*!< [13..13] Page360 - 367                                                    */
      __IOM uint32_t LOCK46     : 1;            /*!< [14..14] Page368 - 375                                                    */
      __IOM uint32_t LOCK47     : 1;            /*!< [15..15] Page376 - 383                                                    */
      __OM  uint32_t KEY        : 16;           /*!< [31..16] desc KEY                                                         */
    } PAGELOCK3_f;
  } ;
  
  union {
    __IOM uint32_t PAGELOCK4;                   /*!< (@ 0x00000014) desc PAGELOCK4                                             */
    
    struct {
      __IOM uint32_t LOCK48     : 1;            /*!< [0..0] Page384 - 391                                                      */
      __IOM uint32_t LOCK49     : 1;            /*!< [1..1] Page392 - 399                                                      */
      __IOM uint32_t LOCK50     : 1;            /*!< [2..2] Page400 - 407                                                      */
      __IOM uint32_t LOCK51     : 1;            /*!< [3..3] Page408 - 415                                                      */
      __IOM uint32_t LOCK52     : 1;            /*!< [4..4] Page416 - 423                                                      */
      __IOM uint32_t LOCK53     : 1;            /*!< [5..5] Page424 - 431                                                      */
      __IOM uint32_t LOCK54     : 1;            /*!< [6..6] Page432 - 439                                                      */
      __IOM uint32_t LOCK55     : 1;            /*!< [7..7] Page440 - 447                                                      */
      __IOM uint32_t LOCK56     : 1;            /*!< [8..8] Page448 - 455                                                      */
      __IOM uint32_t LOCK57     : 1;            /*!< [9..9] Page456 - 463                                                      */
      __IOM uint32_t LOCK58     : 1;            /*!< [10..10] Page464 - 471                                                    */
      __IOM uint32_t LOCK59     : 1;            /*!< [11..11] Page472 - 479                                                    */
      __IOM uint32_t LOCK60     : 1;            /*!< [12..12] Page480 - 487                                                    */
      __IOM uint32_t LOCK61     : 1;            /*!< [13..13] Page488 - 495                                                    */
      __IOM uint32_t LOCK62     : 1;            /*!< [14..14] Page496 - 503                                                    */
      __IOM uint32_t LOCK63     : 1;            /*!< [15..15] Page504 - 511                                                    */
      __OM  uint32_t KEY        : 16;           /*!< [31..16] desc KEY                                                         */
    } PAGELOCK4_f;
  } ;
  __IM  uint32_t  RESERVED[2];
  
  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000020) desc IER                                                   */
    
