qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
    struct {
      __IOM uint32_t ARR        : 12;           /*!< [11..0] desc ARR                                                          */
      __IM  uint32_t            : 20;
    } ARR_f;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< (@ 0x0000000C) desc SR                                                    */
    
    struct {
      __IM  uint32_t CRF        : 1;            /*!< [0..0] desc CRF                                                           */
      __IM  uint32_t ARRF       : 1;            /*!< [1..1] desc ARRF                                                          */
      __IM  uint32_t WINRF      : 1;            /*!< [2..2] desc WINRF                                                         */
      __IOM uint32_t OV         : 1;            /*!< [3..3] desc OV                                                            */
      __IM  uint32_t RUN        : 1;            /*!< [4..4] desc RUN                                                           */
      __IM  uint32_t RELOAD     : 1;            /*!< [5..5] desc RELOAD                                                        */
      __IM  uint32_t            : 26;
    } SR_f;
  } ;
  
  union {
    __IOM uint32_t WINR;                        /*!< (@ 0x00000010) desc WINR                                                  */
    
    struct {
      __IOM uint32_t WINR       : 12;           /*!< [11..0] desc WINR                                                         */
      __IM  uint32_t            : 20;
    } WINR_f;
  } ;
  __IM  uint32_t  RESERVED[4];
  
  union {
    __IM  uint32_t CNT;                         /*!< (@ 0x00000024) desc CNT                                                   */
    
    struct {
      __IM  uint32_t CNT        : 12;           /*!< [11..0] desc CNT                                                          */
      __IM  uint32_t            : 20;
    } CNT_f;
  } ;
} IWDT_TypeDef;                                    /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                            LCD                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc LCD (LCD)
  */

typedef struct {                                /*!< (@ 0x40002400) LCD Structure                                              */
  
  union {
    __IOM uint32_t CR0;                         /*!< (@ 0x00000000) desc CR0                                                   */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t CPCLK      : 2;            /*!< [2..1] desc CPCLK                                                         */
      __IOM uint32_t BUMP       : 1;            /*!< [3..3] desc BUMP                                                          */
      __IOM uint32_t BIAS       : 1;            /*!< [4..4] desc BIAS                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t DUTY       : 3;            /*!< [8..6] desc DUTY                                                          */
      __IOM uint32_t INRS       : 3;            /*!< [11..9] desc INRS                                                         */
      __IOM uint32_t CONTRAST   : 4;            /*!< [15..12] desc CONTRAST                                                    */
      __IM  uint32_t            : 16;
    } CR0_f;
  } ;
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000004) desc CR1                                                   */
    
    struct {
      __IOM uint32_t BLINKCNT   : 6;            /*!< [5..0] desc BLINKCNT                                                      */
      __IOM uint32_t BLINKEN    : 1;            /*!< [6..6] desc BLINKEN                                                       */
      __IOM uint32_t CLKCS      : 1;            /*!< [7..7] desc CLKCS                                                         */
      __IOM uint32_t LCDFS      : 2;            /*!< [9..8] desc LCDFS                                                         */
      __IOM uint32_t DMAEN      : 1;            /*!< [10..10] desc DMAEN                                                       */
      __IOM uint32_t IE         : 1;            /*!< [11..11] desc IE                                                          */
      __IM  uint32_t INTF       : 1;            /*!< [12..12] desc INTF                                                        */
      __IM  uint32_t            : 19;
    } CR1_f;
  } ;
  
  union {
    __IOM uint32_t INTCLR;                      /*!< (@ 0x00000008) desc INTCLR                                                */
    
    struct {
      __IM  uint32_t            : 12;
      __IOM uint32_t INTF       : 1;            /*!< [12..12] desc INTF                                                        */
      __IM  uint32_t            : 19;
    } INTCLR_f;
  } ;
  
  union {
    __IOM uint32_t PINEN1;                      /*!< (@ 0x0000000C) desc PINEN1                                                */
    
    struct {
      __IOM uint32_t SEGX       : 24;           /*!< [23..0] desc SEGX                                                         */
      __IOM uint32_t SEG_VBIAS  : 4;            /*!< [27..24] desc SEG_VBIAS                                                   */
      __IOM uint32_t SEG_COM    : 4;            /*!< [31..28] desc SEG_COM                                                     */
    } PINEN1_f;
  } ;
  
  union {
    __IOM uint32_t PINEN2;                      /*!< (@ 0x00000010) desc PINEN2                                                */
    
