qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
    struct {
      __IOM uint32_t SOURCE     : 2;            /*!< [1..0] desc SOURCE                                                        */
      __IOM uint32_t FREQIN     : 2;            /*!< [3..2] desc FREQIN                                                        */
      __IOM uint32_t MUL        : 5;            /*!< [8..4] desc MUL                                                           */
      __IOM uint32_t FREQOUT    : 3;            /*!< [11..9] desc FREQOUT                                                      */
      __IOM uint32_t WAITCYCLE  : 3;            /*!< [14..12] desc WAITCYCLE                                                   */
      __IM  uint32_t STABLE     : 1;            /*!< [15..15] desc STABLE                                                      */
      __IM  uint32_t            : 16;
    } PLL_f;
  } ;
  
  union {
    __IOM uint32_t DEBUG;                       /*!< (@ 0x0000002C) desc DEBUG                                                 */
    
    struct {
      __IOM uint32_t ATIM       : 1;            /*!< [0..0] desc ATIM                                                          */
      __IOM uint32_t GTIM1      : 1;            /*!< [1..1] desc GTIM1                                                         */
      __IOM uint32_t GTIM2      : 1;            /*!< [2..2] desc GTIM2                                                         */
      __IOM uint32_t GTIM3      : 1;            /*!< [3..3] desc GTIM3                                                         */
      __IOM uint32_t GTIM4      : 1;            /*!< [4..4] desc GTIM4                                                         */
      __IOM uint32_t BTIM123    : 1;            /*!< [5..5] desc BTIM123                                                       */
      __IOM uint32_t AUTOTRIM        : 1;            /*!< [6..6] desc AUTOTRIM                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t RTC        : 1;            /*!< [8..8] desc RTC                                                           */
      __IOM uint32_t IWDT       : 1;            /*!< [9..9] desc IWDT                                                          */
      __IOM uint32_t WWDT       : 1;            /*!< [10..10] desc WWDT                                                        */
      __IOM uint32_t LPTIM      : 1;            /*!< [11..11] desc LPTIM                                                       */
      __IM  uint32_t            : 20;
    } DEBUG_f;
  } ;
  
  union {
    __IOM uint32_t AHBEN;                       /*!< (@ 0x00000030) desc AHBEN                                                 */
    
    struct {
      __IOM uint32_t DMA        : 1;            /*!< [0..0] desc DMA                                                           */
      __IOM uint32_t FLASH      : 1;            /*!< [1..1] desc FLASH                                                         */
      __IOM uint32_t CRC        : 1;            /*!< [2..2] desc CRC                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t GPIOA      : 1;            /*!< [4..4] desc GPIOA                                                         */
      __IOM uint32_t GPIOB      : 1;            /*!< [5..5] desc GPIOB                                                         */
      __IOM uint32_t GPIOC      : 1;            /*!< [6..6] desc GPIOC                                                         */
      __IOM uint32_t GPIOD      : 1;            /*!< [7..7] desc GPIOD                                                         */
      __IOM uint32_t GPIOE      : 1;            /*!< [8..8] desc GPIOE                                                         */
      __IOM uint32_t GPIOF      : 1;            /*!< [9..9] desc GPIOF                                                         */
      __IOM uint32_t TRNG       : 1;            /*!< [10..10] desc TRNG                                                        */
      __IOM uint32_t AES        : 1;            /*!< [11..11] desc AES                                                         */
      __IM  uint32_t            : 20;
    } AHBEN_f;
  } ;
  
  union {
    __IOM uint32_t APBEN2;                      /*!< (@ 0x00000034) desc APBEN2                                                */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t UART6      : 1;            /*!< [1..1] desc UART6                                                         */
      __IOM uint32_t ADC        : 1;            /*!< [2..2] desc ADC                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t VC         : 1;            /*!< [4..4] desc VC                                                            */
      __IM  uint32_t            : 2;
      __IOM uint32_t ATIM       : 1;            /*!< [7..7] desc ATIM                                                          */
      __IOM uint32_t SPI1       : 1;            /*!< [8..8] desc SPI1                                                          */
      __IOM uint32_t UART1      : 1;            /*!< [9..9] desc UART1                                                         */
      __IOM uint32_t GTIM3      : 1;            /*!< [10..10] desc GTIM3                                                       */
      __IOM uint32_t GTIM4      : 1;            /*!< [11..11] desc GTIM4                                                       */
      __IOM uint32_t BTIM       : 1;            /*!< [12..12] desc BTIM                                                        */
      __IOM uint32_t AUTOTRIM   : 1;            /*!< [13..13] desc AUTOTRIM                                                         */
      __IM  uint32_t            : 18;
    } APBEN2_f;
  } ;
  
  union {
    __IOM uint32_t APBEN1;                      /*!< (@ 0x00000038) desc APBEN1                                                */
    
