qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t GTIM1      : 1;            /*!< [1..1] desc GTIM1                                                         */
      __IOM uint32_t GTIM2      : 1;            /*!< [2..2] desc GTIM2                                                         */
      __IOM uint32_t RTC        : 1;            /*!< [3..3] desc RTC                                                           */
      __IOM uint32_t WWDT       : 1;            /*!< [4..4] desc WWDT                                                          */
      __IOM uint32_t IWDT       : 1;            /*!< [5..5] desc IWDT                                                          */
      __IOM uint32_t SPI2       : 1;            /*!< [6..6] desc SPI2                                                          */
      __IOM uint32_t UART2      : 1;            /*!< [7..7] desc UART2                                                         */
      __IOM uint32_t UART3      : 1;            /*!< [8..8] desc UART3                                                         */
      __IOM uint32_t UART4      : 1;            /*!< [9..9] desc UART4                                                         */
      __IOM uint32_t UART5      : 1;            /*!< [10..10] desc UART5                                                       */
      __IOM uint32_t I2C1       : 1;            /*!< [11..11] desc I2C1                                                        */
      __IOM uint32_t I2C2       : 1;            /*!< [12..12] desc I2C2                                                        */
      __IOM uint32_t LCD        : 1;            /*!< [13..13] desc LCD                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t LPTIM      : 1;            /*!< [15..15] desc LPTIM                                                       */
      __IM  uint32_t            : 16;
    } APBEN1_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t AHBRST;                      /*!< (@ 0x00000040) desc AHBRST                                                */
    
    struct {
      __IOM uint32_t DMA        : 1;            /*!< [0..0] desc DMA                                                           */
      __IOM uint32_t FLASH      : 1;            /*!< [1..1] desc FLASH                                                         */
      __IOM uint32_t CRC        : 1;            /*!< [2..2] desc CRC                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t GPIOA      : 1;            /*!< [4..4] desc GPIOA                                                         */
      __IOM uint32_t GPIOB      : 1;            /*!< [5..5] desc GPIOB                                                         */
      __IOM uint32_t GPIOC      : 1;            /*!< [6..6] desc GPIOC                                                         */
      __IOM uint32_t GPIOD      : 1;            /*!< [7..7] desc GPIOD                                                         */
      __IOM uint32_t GPIOE      : 1;            /*!< [8..8] desc GPIOE                                                         */
      __IOM uint32_t GPIOF      : 1;            /*!< [9..9] desc GPIOF                                                         */
      __IOM uint32_t TRNG       : 1;            /*!< [10..10] desc TRNG                                                        */
      __IOM uint32_t AES        : 1;            /*!< [11..11] desc AES                                                         */
      __IM  uint32_t            : 20;
    } AHBRST_f;
  } ;
  
  union {
    __IOM uint32_t APBRST2;                     /*!< (@ 0x00000044) desc APBRST2                                               */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t UART6      : 1;            /*!< [1..1] desc UART6                                                         */
      __IOM uint32_t ADC        : 1;            /*!< [2..2] desc ADC                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t VC         : 1;            /*!< [4..4] desc VC                                                            */
      __IM  uint32_t            : 2;
      __IOM uint32_t ATIM       : 1;            /*!< [7..7] desc ATIM                                                          */
      __IOM uint32_t SPI1       : 1;            /*!< [8..8] desc SPI1                                                          */
      __IOM uint32_t UART1      : 1;            /*!< [9..9] desc UART1                                                         */
      __IOM uint32_t GTIM3      : 1;            /*!< [10..10] desc GTIM3                                                       */
      __IOM uint32_t GTIM4      : 1;            /*!< [11..11] desc GTIM4                                                       */
      __IOM uint32_t BTIM       : 1;            /*!< [12..12] desc BTIM                                                        */
      __IOM uint32_t AUTOTRIM   : 1;            /*!< [13..13] desc AUTOTRIM                                                         */
      __IM  uint32_t            : 18;
    } APBRST2_f;
  } ;
  
  union {
    __IOM uint32_t APBRST1;                     /*!< (@ 0x00000048) desc APBRST1                                               */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t GTIM1      : 1;            /*!< [1..1] desc GTIM1                                                         */
      __IOM uint32_t GTIM2      : 1;            /*!< [2..2] desc GTIM2                                                         */
      __IOM uint32_t RTC        : 1;            /*!< [3..3] desc RTC                                                           */
      __IOM uint32_t WWDT       : 1;            /*!< [4..4] desc WWDT                                                          */
      __IOM uint32_t IWDT       : 1;            /*!< [5..5] desc IWDT                                                          */
      __IOM uint32_t SPI2       : 1;            /*!< [6..6] desc SPI2                                                          */
      __IOM uint32_t UART2      : 1;            /*!< [7..7] desc UART2                                                         */
      __IOM uint32_t UART3      : 1;            /*!< [8..8] desc UART3                                                         */
      __IOM uint32_t UART4      : 1;            /*!< [9..9] desc UART4                                                         */
      __IOM uint32_t UART5      : 1;            /*!< [10..10] desc UART5                                                       */
      __IOM uint32_t I2C1       : 1;            /*!< [11..11] desc I2C1                                                        */
      __IOM uint32_t I2C2       : 1;            /*!< [12..12] desc I2C2                                                        */
      __IOM uint32_t LCD        : 1;            /*!< [13..13] desc LCD                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t LPTIM      : 1;            /*!< [15..15] desc LPTIM                                                       */
      __IM  uint32_t            : 16;
    } APBRST1_f;
  } ;
  
  union {
    __IOM uint32_t RESETFLAG;                   /*!< (@ 0x0000004C) desc RESETFLAG                                             */
    
