qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
    struct {
      __IOM uint32_t POR        : 1;            /*!< [0..0] desc VCC                                                           */
      __IOM uint32_t            : 1;            /*!< [1..1] desc                                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t LVD        : 1;            /*!< [3..3] desc LVD                                                           */
      __IOM uint32_t IWDT       : 1;            /*!< [4..4] desc IWDT                                                          */
      __IOM uint32_t WWDT       : 1;            /*!< [5..5] desc WWDT                                                          */
      __IOM uint32_t RSTB       : 1;            /*!< [6..6] desc RSTB                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t LOCKUP     : 1;            /*!< [8..8] desc LOCKUP                                                        */
      __IOM uint32_t SYSRESETREQ : 1;           /*!< [9..9] desc SYSRESETREQ                                                   */
      __IM  uint32_t            : 22;
    } RESETFLAG_f;
  } ;
  
  union {
    __IOM uint32_t GTIM1CAP;                    /*!< (@ 0x00000050) desc GTIM1CAP                                              */
    
    struct {
      __IOM uint32_t CH1        : 3;            /*!< [2..0] desc CH1                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH2        : 3;            /*!< [6..4] desc CH2                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH3        : 3;            /*!< [10..8] desc CH3                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH4        : 3;            /*!< [14..12] desc CH4                                                         */
      __IM  uint32_t            : 17;
    } GTIM1CAP_f;
  } ;
  
  union {
    __IOM uint32_t GTIM2CAP;                    /*!< (@ 0x00000054) desc GTIM2CAP                                              */
    
    struct {
      __IOM uint32_t CH1        : 3;            /*!< [2..0] desc CH1                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH2        : 3;            /*!< [6..4] desc CH2                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH3        : 3;            /*!< [10..8] desc CH3                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH4        : 3;            /*!< [14..12] desc CH4                                                         */
      __IM  uint32_t            : 17;
    } GTIM2CAP_f;
  } ;
  
  union {
    __IOM uint32_t GTIM3CAP;                    /*!< (@ 0x00000058) desc GTIM3CAP                                              */
    
    struct {
      __IOM uint32_t CH1        : 3;            /*!< [2..0] desc CH1                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH2        : 3;            /*!< [6..4] desc CH2                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH3        : 3;            /*!< [10..8] desc CH3                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH4        : 3;            /*!< [14..12] desc CH4                                                         */
      __IM  uint32_t            : 17;
    } GTIM3CAP_f;
  } ;
  
  union {
    __IOM uint32_t GTIM4CAP;                    /*!< (@ 0x0000005C) desc GTIM4CAP                                              */
    
    struct {
      __IOM uint32_t CH1        : 3;            /*!< [2..0] desc CH1                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH2        : 3;            /*!< [6..4] desc CH2                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH3        : 3;            /*!< [10..8] desc CH3                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CH4        : 3;            /*!< [14..12] desc CH4                                                         */
      __IM  uint32_t            : 17;
    } GTIM4CAP_f;
  } ;
  
  union {
    __IOM uint32_t ATIMETR;                     /*!< (@ 0x00000060) desc ATIMETR                                               */
    
    struct {
      __IOM uint32_t ATIMETR    : 3;            /*!< [2..0] desc ATIMETR                                                       */
      __IM  uint32_t            : 29;
    } ATIMETR_f;
  } ;
  
  union {
    __IOM uint32_t GTIMETR;                     /*!< (@ 0x00000064) desc GTIMETR                                               */
    
    struct {
      __IOM uint32_t GTIM1ETR   : 3;            /*!< [2..0] desc GTIM1ETR                                                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t GTIM2ETR   : 3;            /*!< [6..4] desc GTIM2ETR                                                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t GTIM3ETR   : 3;            /*!< [10..8] desc GTIM3ETR                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t GTIM4ETR   : 3;            /*!< [14..12] desc GTIM4ETR                                                    */
      __IM  uint32_t            : 17;
    } GTIMETR_f;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t TIMITR;                      /*!< (@ 0x0000006C) desc TIMITR                                                */
    
