qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
    struct {
      __IOM uint32_t ATIMITR    : 3;            /*!< [2..0] desc ATIMITR                                                       */
      __IOM uint32_t GTIM1ITR   : 3;            /*!< [5..3] desc GTIM1ITR                                                      */
      __IOM uint32_t GTIM2ITR   : 3;            /*!< [8..6] desc GTIM2ITR                                                      */
      __IOM uint32_t GTIM3ITR   : 3;            /*!< [11..9] desc GTIM3ITR                                                     */
      __IOM uint32_t GTIM4ITR   : 3;            /*!< [14..12] desc GTIM4ITR                                                    */
      __IOM uint32_t BTIM1ITR   : 3;            /*!< [17..15] desc BTIM1ITR                                                    */
      __IOM uint32_t BTIM2ITR   : 3;            /*!< [20..18] desc BTIM2ITR                                                    */
      __IOM uint32_t BTIM3ITR   : 3;            /*!< [23..21] desc BTIM3ITR                                                    */
      __IM  uint32_t            : 8;
    } TIMITR_f;
  } ;
  
  union {
    __IOM uint32_t MCO;                         /*!< (@ 0x00000070) desc MCO                                                   */
    
    struct {
      __IOM uint32_t SOURCE     : 4;            /*!< [3..0] desc SOURCE                                                        */
      __IOM uint32_t DIV        : 3;            /*!< [6..4] desc DIV                                                           */
      __IM  uint32_t            : 25;
    } MCO_f;
  } ;
  
  union {
    __IOM uint32_t IRMOD;                       /*!< (@ 0x00000074) desc IRMOD                                                 */
    
    struct {
      __IOM uint32_t MOD        : 4;            /*!< [3..0] desc MOD                                                           */
      __IM  uint32_t            : 28;
    } IRMOD_f;
  } ;
} SYSCTRL_TypeDef;                                 /*!< Size = 120 (0x78)                                                         */



/* =========================================================================================================================== */
/* ================                                           TRNG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc TRNG (TRNG)
  */

typedef struct {                                /*!< (@ 0x40025000) TRNG Structure                                             */
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000000) desc CR1                                                   */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t START      : 1;            /*!< [1..1] desc START                                                         */
      __IM  uint32_t            : 30;
    } CR1_f;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000004) desc CR2                                                   */
    
    struct {
      __IOM uint32_t SOURCE     : 2;            /*!< [1..0] desc SOURCE                                                        */
      __IOM uint32_t SHIFT      : 3;            /*!< [4..2] desc SHIFT                                                         */
      __IM  uint32_t            : 27;
    } CR2_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IM  uint32_t DATA0;                       /*!< (@ 0x0000000C) desc DATA0                                                 */
    
    struct {
      __IM  uint32_t DATA0      : 32;           /*!< [31..0] desc DATA0                                                        */
    } DATA0_f;
  } ;
  
  union {
    __IM  uint32_t DATA1;                       /*!< (@ 0x00000010) desc DATA1                                                 */
    
    struct {
      __IM  uint32_t DATA1      : 32;           /*!< [31..0] desc DATA1                                                        */
    } DATA1_f;
  } ;
} TRNG_TypeDef;                                    /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                           UART1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief desc UART1 (UART1)
  */

typedef struct {                                /*!< (@ 0x40013800) UART1 Structure                                            */
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000000) desc CR1                                                   */
    
    struct {
      __IOM uint32_t TXEN       : 1;            /*!< [0..0] desc TXEN                                                          */
      __IOM uint32_t RXEN       : 1;            /*!< [1..1] desc RXEN                                                          */
      __IOM uint32_t PARITY     : 2;            /*!< [3..2] desc PARITY                                                        */
      __IOM uint32_t STOP       : 2;            /*!< [5..4] desc STOP                                                          */
      __IOM uint32_t SYNC       : 1;            /*!< [6..6] desc SYNC                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t START      : 1;            /*!< [8..8] desc START                                                         */
      __IOM uint32_t OVER       : 2;            /*!< [10..9] desc OVER                                                         */
      __IM  uint32_t            : 21;
    } CR1_f;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000004) desc CR2                                                   */
    
