qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
    struct {
      __IOM uint32_t WCNT       : 7;            /*!< [6..0] desc WCNT                                                          */
      __IOM uint32_t EN         : 1;            /*!< [7..7] desc EN                                                            */
      __IM  uint32_t            : 24;
    } CR0_f;
  } ;
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000004) desc CR1                                                   */
    
    struct {
      __IOM uint32_t WINR       : 7;            /*!< [6..0] desc WINR                                                          */
      __IOM uint32_t PRS        : 3;            /*!< [9..7] desc PRS                                                           */
      __IOM uint32_t IE         : 1;            /*!< [10..10] desc IE                                                          */
      __IM  uint32_t            : 21;
    } CR1_f;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< (@ 0x00000008) desc SR                                                    */
    
    struct {
      __IOM uint32_t POV        : 1;            /*!< [0..0] desc POV                                                           */
      __IM  uint32_t            : 31;
    } SR_f;
  } ;
} WWDT_TypeDef;                                    /*!< Size = 12 (0xc)                                                           */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define ADC_BASE                    0x40012400UL
#define AES_BASE                    0x40026000UL
#define ATIM_BASE                   0x40012C00UL
#define AUTOTRIM_BASE               0x40014C00UL
#define BTIM1_BASE                  0x40014800UL
#define BTIM2_BASE                  0x40014900UL
#define BTIM3_BASE                  0x40014A00UL
#define CRC_BASE                    0x40023000UL
#define DMA_BASE                    0x40020000UL
#define DMACHANNEL1_BASE            0x40020020UL
#define DMACHANNEL2_BASE            0x40020040UL
#define DMACHANNEL3_BASE            0x40020060UL
#define DMACHANNEL4_BASE            0x40020080UL
#define DMACHANNEL5_BASE            0x400200A0UL
#define FLASH_BASE                  0x40022000UL
#define GPIOA_BASE                  0x48000000UL
#define GPIOB_BASE                  0x48000400UL
#define GPIOC_BASE                  0x48000800UL
#define GPIOD_BASE                  0x48000C00UL
#define GPIOE_BASE                  0x48001000UL
#define GPIOF_BASE                  0x48001400UL
#define GTIM1_BASE                  0x40000400UL
#define GTIM2_BASE                  0x40001000UL
#define GTIM3_BASE                  0x40014000UL
#define GTIM4_BASE                  0x40014400UL
#define I2C1_BASE                   0x40005400UL
#define I2C2_BASE                   0x40005800UL
#define IWDT_BASE                   0x40003000UL
#define LCD_BASE                    0x40002400UL
#define LPTIM_BASE                  0x40007800UL
#define LVD_BASE                    0x40012A80UL
#define RAM_BASE                    0x40022400UL
#define RTC_BASE                    0x40002800UL
#define SPI1_BASE                   0x40013000UL
#define SPI2_BASE                   0x40003800UL
#define SYSCTRL_BASE                0x40010000UL
#define TRNG_BASE                   0x40025000UL
#define UART1_BASE                  0x40013800UL
#define UART2_BASE                  0x40004400UL
#define UART3_BASE                  0x40004800UL
#define UART4_BASE                  0x40004C00UL
#define UART5_BASE                  0x40005000UL
#define UART6_BASE                  0x40011400UL
#define VC1_BASE                    0x40012A00UL
#define VC2_BASE                    0x40012A10UL
#define WWDT_BASE                   0x40002C00UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define CW_ADC                         ((ADC_TypeDef*)               ADC_BASE)
#define CW_AES                         ((AES_TypeDef*)               AES_BASE)
#define CW_ATIM                        ((ATIM_TypeDef*)              ATIM_BASE)
#define CW_AUTOTRIM                    ((AUTOTRIM_TypeDef*)          AUTOTRIM_BASE)
#define CW_BTIM1                       ((BTIM_TypeDef*)              BTIM1_BASE)
#define CW_BTIM2                       ((BTIM_TypeDef*)              BTIM2_BASE)
#define CW_BTIM3                       ((BTIM_TypeDef*)              BTIM3_BASE)
#define CW_CRC                         ((CRC_TypeDef*)               CRC_BASE)
#define CW_DMA                         ((DMA_TypeDef*)               DMA_BASE)
#define CW_DMACHANNEL1                 ((DMACHANNEL_TypeDef*)        DMACHANNEL1_BASE)
#define CW_DMACHANNEL2                 ((DMACHANNEL_TypeDef*)        DMACHANNEL2_BASE)
#define CW_DMACHANNEL3                 ((DMACHANNEL_TypeDef*)        DMACHANNEL3_BASE)
#define CW_DMACHANNEL4                 ((DMACHANNEL_TypeDef*)        DMACHANNEL4_BASE)
#define CW_DMACHANNEL5                 ((DMACHANNEL_TypeDef*)        DMACHANNEL5_BASE)
#define CW_FLASH                       ((FLASH_TypeDef*)             FLASH_BASE)
#define CW_GPIOA                       ((GPIO_TypeDef*)              GPIOA_BASE)
#define CW_GPIOB                       ((GPIO_TypeDef*)              GPIOB_BASE)
#define CW_GPIOC                       ((GPIO_TypeDef*)              GPIOC_BASE)
#define CW_GPIOD                       ((GPIO_TypeDef*)              GPIOD_BASE)
#define CW_GPIOE                       ((GPIO_TypeDef*)              GPIOE_BASE)
#define CW_GPIOF                       ((GPIO_TypeDef*)              GPIOF_BASE)
#define CW_GTIM1                       ((GTIM_TypeDef*)              GTIM1_BASE)
#define CW_GTIM2                       ((GTIM_TypeDef*)              GTIM2_BASE)
#define CW_GTIM3                       ((GTIM_TypeDef*)              GTIM3_BASE)
#define CW_GTIM4                       ((GTIM_TypeDef*)              GTIM4_BASE)
#define CW_I2C1                        ((I2C_TypeDef*)               I2C1_BASE)
#define CW_I2C2                        ((I2C_TypeDef*)               I2C2_BASE)
#define CW_IWDT                        ((IWDT_TypeDef*)              IWDT_BASE)
#define CW_LCD                         ((LCD_TypeDef*)               LCD_BASE)
#define CW_LPTIM                       ((LPTIM_TypeDef*)             LPTIM_BASE)
#define CW_LVD                         ((LVD_TypeDef*)               LVD_BASE)
#define CW_RAM                         ((RAM_TypeDef*)               RAM_BASE)
#define CW_RTC                         ((RTC_TypeDef*)               RTC_BASE)
#define CW_SPI1                        ((SPI_TypeDef*)               SPI1_BASE)
#define CW_SPI2                        ((SPI_TypeDef*)               SPI2_BASE)
#define CW_SYSCTRL                     ((SYSCTRL_TypeDef*)           SYSCTRL_BASE)
#define CW_TRNG                        ((TRNG_TypeDef*)              TRNG_BASE)
#define CW_UART1                       ((UART_TypeDef*)              UART1_BASE)
#define CW_UART2                       ((UART_TypeDef*)              UART2_BASE)
#define CW_UART3                       ((UART_TypeDef*)              UART3_BASE)
#define CW_UART4                       ((UART_TypeDef*)              UART4_BASE)
#define CW_UART5                       ((UART_TypeDef*)              UART5_BASE)
#define CW_UART6                       ((UART_TypeDef*)              UART6_BASE)
#define CW_VC1                         ((VC_TypeDef*)                VC1_BASE)
#define CW_VC2                         ((VC_TypeDef*)                VC2_BASE)
#define CW_WWDT                        ((WWDT_TypeDef*)              WWDT_BASE)


