qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
/* ========================================================  RESULT1  ======================================================== */
#define ADC_RESULT1_RESULT_Pos            (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT1_RESULT_Msk            (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */
/* ========================================================  RESULT2  ======================================================== */
#define ADC_RESULT2_RESULT_Pos            (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT2_RESULT_Msk            (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */
/* ========================================================  RESULT3  ======================================================== */
#define ADC_RESULT3_RESULT_Pos            (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT3_RESULT_Msk            (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */
/* ========================================================  RESULT4  ======================================================== */
#define ADC_RESULT4_RESULT_Pos            (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT4_RESULT_Msk            (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */
/* ========================================================  RESULT5  ======================================================== */
#define ADC_RESULT5_RESULT_Pos            (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT5_RESULT_Msk            (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */
/* ========================================================  RESULT6  ======================================================== */
#define ADC_RESULT6_RESULT_Pos            (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT6_RESULT_Msk            (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */
/* ========================================================  RESULT7  ======================================================== */
#define ADC_RESULT7_RESULT_Pos            (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT7_RESULT_Msk            (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */
/* =======================================================  RESULTACC  ======================================================= */
#define ADC_RESULTACC_RESULT_Pos          (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULTACC_RESULT_Msk          (0xffffffUL)              /*!< RESULT (Bitfield-Mask: 0xffffff)                      */


/* =========================================================================================================================== */
/* ================                                            AES                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define AES_CR_KEYSIZE_Pos                (3UL)                     /*!< KEYSIZE (Bit 3)                                       */
#define AES_CR_KEYSIZE_Msk                (0x18UL)                  /*!< KEYSIZE (Bitfield-Mask: 0x03)                         */
#define AES_CR_MODE_Pos                   (1UL)                     /*!< MODE (Bit 1)                                          */
#define AES_CR_MODE_Msk                   (0x2UL)                   /*!< MODE (Bitfield-Mask: 0x01)                            */
#define AES_CR_START_Pos                  (0UL)                     /*!< START (Bit 0)                                         */
#define AES_CR_START_Msk                  (0x1UL)                   /*!< START (Bitfield-Mask: 0x01)                           */
/* =========================================================  DATA0  ========================================================= */
#define AES_DATA0_DATA0_Pos               (0UL)                     /*!< DATA0 (Bit 0)                                         */
#define AES_DATA0_DATA0_Msk               (0xffffffffUL)            /*!< DATA0 (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  DATA1  ========================================================= */
#define AES_DATA1_DATA1_Pos               (0UL)                     /*!< DATA1 (Bit 0)                                         */
#define AES_DATA1_DATA1_Msk               (0xffffffffUL)            /*!< DATA1 (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  DATA2  ========================================================= */
#define AES_DATA2_DATA2_Pos               (0UL)                     /*!< DATA2 (Bit 0)                                         */
#define AES_DATA2_DATA2_Msk               (0xffffffffUL)            /*!< DATA2 (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  DATA3  ========================================================= */
#define AES_DATA3_DATA3_Pos               (0UL)                     /*!< DATA3 (Bit 0)                                         */
#define AES_DATA3_DATA3_Msk               (0xffffffffUL)            /*!< DATA3 (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  KEY0  ========================================================== */
#define AES_KEY0_KEY0_Pos                 (0UL)                     /*!< KEY0 (Bit 0)                                          */
#define AES_KEY0_KEY0_Msk                 (0xffffffffUL)            /*!< KEY0 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY1  ========================================================== */
#define AES_KEY1_KEY1_Pos                 (0UL)                     /*!< KEY1 (Bit 0)                                          */
#define AES_KEY1_KEY1_Msk                 (0xffffffffUL)            /*!< KEY1 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY2  ========================================================== */
#define AES_KEY2_KEY2_Pos                 (0UL)                     /*!< KEY2 (Bit 0)                                          */
#define AES_KEY2_KEY2_Msk                 (0xffffffffUL)            /*!< KEY2 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY3  ========================================================== */
#define AES_KEY3_KEY3_Pos                 (0UL)                     /*!< KEY3 (Bit 0)                                          */
#define AES_KEY3_KEY3_Msk                 (0xffffffffUL)            /*!< KEY3 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY4  ========================================================== */
#define AES_KEY4_KEY4_Pos                 (0UL)                     /*!< KEY4 (Bit 0)                                          */
#define AES_KEY4_KEY4_Msk                 (0xffffffffUL)            /*!< KEY4 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY5  ========================================================== */
#define AES_KEY5_KEY5_Pos                 (0UL)                     /*!< KEY5 (Bit 0)                                          */
#define AES_KEY5_KEY5_Msk                 (0xffffffffUL)            /*!< KEY5 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY6  ========================================================== */
#define AES_KEY6_KEY6_Pos                 (0UL)                     /*!< KEY6 (Bit 0)                                          */
#define AES_KEY6_KEY6_Msk                 (0xffffffffUL)            /*!< KEY6 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  KEY7  ========================================================== */
#define AES_KEY7_KEY7_Pos                 (0UL)                     /*!< KEY7 (Bit 0)                                          */
#define AES_KEY7_KEY7_Msk                 (0xffffffffUL)            /*!< KEY7 (Bitfield-Mask: 0xffffffff)                      */


/* =========================================================================================================================== */
/* ================                                           ATIM                                            ================ */
/* =========================================================================================================================== */

