qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
/* ==========================================================  ARR  ========================================================== */
#define ATIM_ARR_ARR_Pos                  (0UL)                     /*!< ARR (Bit 0)                                           */
#define ATIM_ARR_ARR_Msk                  (0xffffUL)                /*!< ARR (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  CNT  ========================================================== */
#define ATIM_CNT_CNT_Pos                  (0UL)                     /*!< CNT (Bit 0)                                           */
#define ATIM_CNT_CNT_Msk                  (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  CR  =========================================================== */
#define ATIM_CR_UNDE_Pos                  (29UL)                    /*!< UNDE (Bit 29)                                         */
#define ATIM_CR_UNDE_Msk                  (0x20000000UL)            /*!< UNDE (Bitfield-Mask: 0x01)                            */
#define ATIM_CR_OVE_Pos                   (28UL)                    /*!< OVE (Bit 28)                                          */
#define ATIM_CR_OVE_Msk                   (0x10000000UL)            /*!< OVE (Bitfield-Mask: 0x01)                             */
#define ATIM_CR_DIR_Pos                   (27UL)                    /*!< DIR (Bit 27)                                          */
#define ATIM_CR_DIR_Msk                   (0x8000000UL)             /*!< DIR (Bitfield-Mask: 0x01)                             */
#define ATIM_CR_BG_Pos                    (26UL)                    /*!< BG (Bit 26)                                           */
#define ATIM_CR_BG_Msk                    (0x4000000UL)             /*!< BG (Bitfield-Mask: 0x01)                              */
#define ATIM_CR_UG_Pos                    (25UL)                    /*!< UG (Bit 25)                                           */
#define ATIM_CR_UG_Msk                    (0x2000000UL)             /*!< UG (Bitfield-Mask: 0x01)                              */
#define ATIM_CR_TG_Pos                    (24UL)                    /*!< TG (Bit 24)                                           */
#define ATIM_CR_TG_Msk                    (0x1000000UL)             /*!< TG (Bitfield-Mask: 0x01)                              */
#define ATIM_CR_OCCE_Pos                  (23UL)                    /*!< OCCE (Bit 23)                                         */
#define ATIM_CR_OCCE_Msk                  (0x800000UL)              /*!< OCCE (Bitfield-Mask: 0x01)                            */
#define ATIM_CR_CISA_Pos                  (21UL)                    /*!< CISA (Bit 21)                                         */
#define ATIM_CR_CISA_Msk                  (0x600000UL)              /*!< CISA (Bitfield-Mask: 0x03)                            */
#define ATIM_CR_BIE_Pos                   (20UL)                    /*!< BIE (Bit 20)                                          */
#define ATIM_CR_BIE_Msk                   (0x100000UL)              /*!< BIE (Bitfield-Mask: 0x01)                             */
#define ATIM_CR_TIE_Pos                   (19UL)                    /*!< TIE (Bit 19)                                          */
#define ATIM_CR_TIE_Msk                   (0x80000UL)               /*!< TIE (Bitfield-Mask: 0x01)                             */
#define ATIM_CR_URS_Pos                   (17UL)                    /*!< URS (Bit 17)                                          */
#define ATIM_CR_URS_Msk                   (0x20000UL)               /*!< URS (Bitfield-Mask: 0x01)                             */
#define ATIM_CR_OCCS_Pos                  (16UL)                    /*!< OCCS (Bit 16)                                         */
#define ATIM_CR_OCCS_Msk                  (0x10000UL)               /*!< OCCS (Bitfield-Mask: 0x01)                            */
#define ATIM_CR_ONESHOT_Pos               (14UL)                    /*!< ONESHOT (Bit 14)                                      */
#define ATIM_CR_ONESHOT_Msk               (0x4000UL)                /*!< ONESHOT (Bitfield-Mask: 0x01)                         */
#define ATIM_CR_MODE_Pos                  (12UL)                    /*!< MODE (Bit 12)                                         */
#define ATIM_CR_MODE_Msk                  (0x3000UL)                /*!< MODE (Bitfield-Mask: 0x03)                            */
#define ATIM_CR_UIE_Pos                   (10UL)                    /*!< UIE (Bit 10)                                          */
#define ATIM_CR_UIE_Msk                   (0x400UL)                 /*!< UIE (Bitfield-Mask: 0x01)                             */
#define ATIM_CR_BUFPEN_Pos                (7UL)                     /*!< BUFPEN (Bit 7)                                        */
#define ATIM_CR_BUFPEN_Msk                (0x80UL)                  /*!< BUFPEN (Bitfield-Mask: 0x01)                          */
#define ATIM_CR_PRS_Pos                   (4UL)                     /*!< PRS (Bit 4)                                           */
#define ATIM_CR_PRS_Msk                   (0x70UL)                  /*!< PRS (Bitfield-Mask: 0x07)                             */
#define ATIM_CR_PWM2S_Pos                 (3UL)                     /*!< PWM2S (Bit 3)                                         */
#define ATIM_CR_PWM2S_Msk                 (0x8UL)                   /*!< PWM2S (Bitfield-Mask: 0x01)                           */
#define ATIM_CR_CT_Pos                    (2UL)                     /*!< CT (Bit 2)                                            */
#define ATIM_CR_CT_Msk                    (0x4UL)                   /*!< CT (Bitfield-Mask: 0x01)                              */
#define ATIM_CR_COMP_Pos                  (1UL)                     /*!< COMP (Bit 1)                                          */
#define ATIM_CR_COMP_Msk                  (0x2UL)                   /*!< COMP (Bitfield-Mask: 0x01)                            */
#define ATIM_CR_EN_Pos                    (0UL)                     /*!< EN (Bit 0)                                            */
#define ATIM_CR_EN_Msk                    (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  ISR  ========================================================== */
#define ATIM_ISR_C4AF_Pos                 (18UL)                    /*!< C4AF (Bit 18)                                         */
#define ATIM_ISR_C4AF_Msk                 (0x40000UL)               /*!< C4AF (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_UNDF_Pos                 (17UL)                    /*!< UNDF (Bit 17)                                         */
#define ATIM_ISR_UNDF_Msk                 (0x20000UL)               /*!< UNDF (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_OVF_Pos                  (16UL)                    /*!< OVF (Bit 16)                                          */
#define ATIM_ISR_OVF_Msk                  (0x10000UL)               /*!< OVF (Bitfield-Mask: 0x01)                             */
#define ATIM_ISR_TIF_Pos                  (15UL)                    /*!< TIF (Bit 15)                                          */
#define ATIM_ISR_TIF_Msk                  (0x8000UL)                /*!< TIF (Bitfield-Mask: 0x01)                             */
#define ATIM_ISR_BIF_Pos                  (14UL)                    /*!< BIF (Bit 14)                                          */
#define ATIM_ISR_BIF_Msk                  (0x4000UL)                /*!< BIF (Bitfield-Mask: 0x01)                             */
#define ATIM_ISR_C3BE_Pos                 (13UL)                    /*!< C3BE (Bit 13)                                         */
#define ATIM_ISR_C3BE_Msk                 (0x2000UL)                /*!< C3BE (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C2BE_Pos                 (12UL)                    /*!< C2BE (Bit 12)                                         */
#define ATIM_ISR_C2BE_Msk                 (0x1000UL)                /*!< C2BE (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C1BE_Pos                 (11UL)                    /*!< C1BE (Bit 11)                                         */
#define ATIM_ISR_C1BE_Msk                 (0x800UL)                 /*!< C1BE (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C3AE_Pos                 (10UL)                    /*!< C3AE (Bit 10)                                         */
#define ATIM_ISR_C3AE_Msk                 (0x400UL)                 /*!< C3AE (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C2AE_Pos                 (9UL)                     /*!< C2AE (Bit 9)                                          */
#define ATIM_ISR_C2AE_Msk                 (0x200UL)                 /*!< C2AE (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C1AE_Pos                 (8UL)                     /*!< C1AE (Bit 8)                                          */
#define ATIM_ISR_C1AE_Msk                 (0x100UL)                 /*!< C1AE (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C3BF_Pos                 (7UL)                     /*!< C3BF (Bit 7)                                          */
#define ATIM_ISR_C3BF_Msk                 (0x80UL)                  /*!< C3BF (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C2BF_Pos                 (6UL)                     /*!< C2BF (Bit 6)                                          */
#define ATIM_ISR_C2BF_Msk                 (0x40UL)                  /*!< C2BF (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C1BF_Pos                 (5UL)                     /*!< C1BF (Bit 5)                                          */
#define ATIM_ISR_C1BF_Msk                 (0x20UL)                  /*!< C1BF (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C3AF_Pos                 (4UL)                     /*!< C3AF (Bit 4)                                          */
#define ATIM_ISR_C3AF_Msk                 (0x10UL)                  /*!< C3AF (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C2AF_Pos                 (3UL)                     /*!< C2AF (Bit 3)                                          */
#define ATIM_ISR_C2AF_Msk                 (0x8UL)                   /*!< C2AF (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_C1AF_Pos                 (2UL)                     /*!< C1AF (Bit 2)                                          */
#define ATIM_ISR_C1AF_Msk                 (0x4UL)                   /*!< C1AF (Bitfield-Mask: 0x01)                            */
#define ATIM_ISR_UIF_Pos                  (0UL)                     /*!< UIF (Bit 0)                                           */
#define ATIM_ISR_UIF_Msk                  (0x1UL)                   /*!< UIF (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define ATIM_ICR_C4AF_Pos                 (18UL)                    /*!< C4AF (Bit 18)                                         */
#define ATIM_ICR_C4AF_Msk                 (0x40000UL)               /*!< C4AF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_UNDF_Pos                 (17UL)                    /*!< UNDF (Bit 17)                                         */
#define ATIM_ICR_UNDF_Msk                 (0x20000UL)               /*!< UNDF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_OVF_Pos                  (16UL)                    /*!< OVF (Bit 16)                                          */
#define ATIM_ICR_OVF_Msk                  (0x10000UL)               /*!< OVF (Bitfield-Mask: 0x01)                             */
#define ATIM_ICR_TIF_Pos                  (15UL)                    /*!< TIF (Bit 15)                                          */
#define ATIM_ICR_TIF_Msk                  (0x8000UL)                /*!< TIF (Bitfield-Mask: 0x01)                             */
#define ATIM_ICR_BIF_Pos                  (14UL)                    /*!< BIF (Bit 14)                                          */
#define ATIM_ICR_BIF_Msk                  (0x4000UL)                /*!< BIF (Bitfield-Mask: 0x01)                             */
#define ATIM_ICR_C3BE_Pos                 (13UL)                    /*!< C3BE (Bit 13)                                         */
#define ATIM_ICR_C3BE_Msk                 (0x2000UL)                /*!< C3BE (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C2BE_Pos                 (12UL)                    /*!< C2BE (Bit 12)                                         */
#define ATIM_ICR_C2BE_Msk                 (0x1000UL)                /*!< C2BE (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C1BE_Pos                 (11UL)                    /*!< C1BE (Bit 11)                                         */
#define ATIM_ICR_C1BE_Msk                 (0x800UL)                 /*!< C1BE (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C3AE_Pos                 (10UL)                    /*!< C3AE (Bit 10)                                         */
#define ATIM_ICR_C3AE_Msk                 (0x400UL)                 /*!< C3AE (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C2AE_Pos                 (9UL)                     /*!< C2AE (Bit 9)                                          */
#define ATIM_ICR_C2AE_Msk                 (0x200UL)                 /*!< C2AE (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C1AE_Pos                 (8UL)                     /*!< C1AE (Bit 8)                                          */
#define ATIM_ICR_C1AE_Msk                 (0x100UL)                 /*!< C1AE (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C3BF_Pos                 (7UL)                     /*!< C3BF (Bit 7)                                          */
#define ATIM_ICR_C3BF_Msk                 (0x80UL)                  /*!< C3BF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C2BF_Pos                 (6UL)                     /*!< C2BF (Bit 6)                                          */
#define ATIM_ICR_C2BF_Msk                 (0x40UL)                  /*!< C2BF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C1BF_Pos                 (5UL)                     /*!< C1BF (Bit 5)                                          */
#define ATIM_ICR_C1BF_Msk                 (0x20UL)                  /*!< C1BF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C3AF_Pos                 (4UL)                     /*!< C3AF (Bit 4)                                          */
#define ATIM_ICR_C3AF_Msk                 (0x10UL)                  /*!< C3AF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C2AF_Pos                 (3UL)                     /*!< C2AF (Bit 3)                                          */
#define ATIM_ICR_C2AF_Msk                 (0x8UL)                   /*!< C2AF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_C1AF_Pos                 (2UL)                     /*!< C1AF (Bit 2)                                          */
#define ATIM_ICR_C1AF_Msk                 (0x4UL)                   /*!< C1AF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_UIF_Pos                  (0UL)                     /*!< UIF (Bit 0)                                           */
#define ATIM_ICR_UIF_Msk                  (0x1UL)                   /*!< UIF (Bitfield-Mask: 0x01)                             */
/* =========================================================  MSCR  ========================================================== */
#define ATIM_MSCR_IB1S_Pos                (12UL)                    /*!< IB1S (Bit 12)                                         */
#define ATIM_MSCR_IB1S_Msk                (0x1000UL)                /*!< IB1S (Bitfield-Mask: 0x01)                            */
#define ATIM_MSCR_IA1S_Pos                (11UL)                    /*!< IA1S (Bit 11)                                         */
#define ATIM_MSCR_IA1S_Msk                (0x800UL)                 /*!< IA1S (Bitfield-Mask: 0x01)                            */
#define ATIM_MSCR_SMS_Pos                 (8UL)                     /*!< SMS (Bit 8)                                           */
#define ATIM_MSCR_SMS_Msk                 (0x700UL)                 /*!< SMS (Bitfield-Mask: 0x07)                             */
#define ATIM_MSCR_TS_Pos                  (5UL)                     /*!< TS (Bit 5)                                            */
#define ATIM_MSCR_TS_Msk                  (0xe0UL)                  /*!< TS (Bitfield-Mask: 0x07)                              */
#define ATIM_MSCR_CCDS_Pos                (3UL)                     /*!< CCDS (Bit 3)                                          */
#define ATIM_MSCR_CCDS_Msk                (0x8UL)                   /*!< CCDS (Bitfield-Mask: 0x01)                            */
#define ATIM_MSCR_MMS_Pos                 (0UL)                     /*!< MMS (Bit 0)                                           */
#define ATIM_MSCR_MMS_Msk                 (0x7UL)                   /*!< MMS (Bitfield-Mask: 0x07)                             */
/* =========================================================  FLTR  ========================================================== */
#define ATIM_FLTR_ETP_Pos                 (31UL)                    /*!< ETP (Bit 31)                                          */
#define ATIM_FLTR_ETP_Msk                 (0x80000000UL)            /*!< ETP (Bitfield-Mask: 0x01)                             */
#define ATIM_FLTR_FLTET_Pos               (28UL)                    /*!< FLTET (Bit 28)                                        */
#define ATIM_FLTR_FLTET_Msk               (0x70000000UL)            /*!< FLTET (Bitfield-Mask: 0x07)                           */
#define ATIM_FLTR_BKP_Pos                 (27UL)                    /*!< BKP (Bit 27)                                          */
#define ATIM_FLTR_BKP_Msk                 (0x8000000UL)             /*!< BKP (Bitfield-Mask: 0x01)                             */
#define ATIM_FLTR_FLTBK_Pos               (24UL)                    /*!< FLTBK (Bit 24)                                        */
#define ATIM_FLTR_FLTBK_Msk               (0x7000000UL)             /*!< FLTBK (Bitfield-Mask: 0x07)                           */
#define ATIM_FLTR_CCP3B_Pos               (23UL)                    /*!< CCP3B (Bit 23)                                        */
#define ATIM_FLTR_CCP3B_Msk               (0x800000UL)              /*!< CCP3B (Bitfield-Mask: 0x01)                           */
#define ATIM_FLTR_OCM3BFLT3B_Pos          (20UL)                    /*!< OCM3BFLT3B (Bit 20)                                   */
#define ATIM_FLTR_OCM3BFLT3B_Msk          (0x700000UL)              /*!< OCM3BFLT3B (Bitfield-Mask: 0x07)                      */
#define ATIM_FLTR_CCP3A_Pos               (19UL)                    /*!< CCP3A (Bit 19)                                        */
#define ATIM_FLTR_CCP3A_Msk               (0x80000UL)               /*!< CCP3A (Bitfield-Mask: 0x01)                           */
#define ATIM_FLTR_OCM3AFLT3A_Pos          (16UL)                    /*!< OCM3AFLT3A (Bit 16)                                   */
#define ATIM_FLTR_OCM3AFLT3A_Msk          (0x70000UL)               /*!< OCM3AFLT3A (Bitfield-Mask: 0x07)                      */
#define ATIM_FLTR_CCP2B_Pos               (15UL)                    /*!< CCP2B (Bit 15)                                        */
#define ATIM_FLTR_CCP2B_Msk               (0x8000UL)                /*!< CCP2B (Bitfield-Mask: 0x01)                           */
#define ATIM_FLTR_OCM2BFLT2B_Pos          (12UL)                    /*!< OCM2BFLT2B (Bit 12)                                   */
#define ATIM_FLTR_OCM2BFLT2B_Msk          (0x7000UL)                /*!< OCM2BFLT2B (Bitfield-Mask: 0x07)                      */
#define ATIM_FLTR_CCP2A_Pos               (11UL)                    /*!< CCP2A (Bit 11)                                        */
#define ATIM_FLTR_CCP2A_Msk               (0x800UL)                 /*!< CCP2A (Bitfield-Mask: 0x01)                           */
#define ATIM_FLTR_OCM2AFLT2A_Pos          (8UL)                     /*!< OCM2AFLT2A (Bit 8)                                    */
#define ATIM_FLTR_OCM2AFLT2A_Msk          (0x700UL)                 /*!< OCM2AFLT2A (Bitfield-Mask: 0x07)                      */
#define ATIM_FLTR_CCP1B_Pos               (7UL)                     /*!< CCP1B (Bit 7)                                         */
#define ATIM_FLTR_CCP1B_Msk               (0x80UL)                  /*!< CCP1B (Bitfield-Mask: 0x01)                           */
#define ATIM_FLTR_OCM1BFLT1B_Pos          (4UL)                     /*!< OCM1BFLT1B (Bit 4)                                    */
#define ATIM_FLTR_OCM1BFLT1B_Msk          (0x70UL)                  /*!< OCM1BFLT1B (Bitfield-Mask: 0x07)                      */
#define ATIM_FLTR_CCP1A_Pos               (3UL)                     /*!< CCP1A (Bit 3)                                         */
#define ATIM_FLTR_CCP1A_Msk               (0x8UL)                   /*!< CCP1A (Bitfield-Mask: 0x01)                           */
#define ATIM_FLTR_OCM1AFLT1A_Pos          (0UL)                     /*!< OCM1AFLT1A (Bit 0)                                    */
#define ATIM_FLTR_OCM1AFLT1A_Msk          (0x7UL)                   /*!< OCM1AFLT1A (Bitfield-Mask: 0x07)                      */
/* =========================================================  TRIG  ========================================================== */
#define ATIM_TRIG_ADTE_Pos                (7UL)                     /*!< ADTE (Bit 7)                                          */
#define ATIM_TRIG_ADTE_Msk                (0x80UL)                  /*!< ADTE (Bitfield-Mask: 0x01)                            */
#define ATIM_TRIG_CM3BE_Pos               (6UL)                     /*!< CM3BE (Bit 6)                                         */
#define ATIM_TRIG_CM3BE_Msk               (0x40UL)                  /*!< CM3BE (Bitfield-Mask: 0x01)                           */
#define ATIM_TRIG_CM2BE_Pos               (5UL)                     /*!< CM2BE (Bit 5)                                         */
#define ATIM_TRIG_CM2BE_Msk               (0x20UL)                  /*!< CM2BE (Bitfield-Mask: 0x01)                           */
#define ATIM_TRIG_CM1BE_Pos               (4UL)                     /*!< CM1BE (Bit 4)                                         */
#define ATIM_TRIG_CM1BE_Msk               (0x10UL)                  /*!< CM1BE (Bitfield-Mask: 0x01)                           */
#define ATIM_TRIG_CM3AE_Pos               (3UL)                     /*!< CM3AE (Bit 3)                                         */
#define ATIM_TRIG_CM3AE_Msk               (0x8UL)                   /*!< CM3AE (Bitfield-Mask: 0x01)                           */
#define ATIM_TRIG_CM2AE_Pos               (2UL)                     /*!< CM2AE (Bit 2)                                         */
#define ATIM_TRIG_CM2AE_Msk               (0x4UL)                   /*!< CM2AE (Bitfield-Mask: 0x01)                           */
#define ATIM_TRIG_CM1AE_Pos               (1UL)                     /*!< CM1AE (Bit 1)                                         */
