qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
/* ==========================================================  CR  =========================================================== */
#define AUTOTRIM_CR_OST_Pos               (11UL)                    /*!< OST (Bit 11)                                          */
#define AUTOTRIM_CR_OST_Msk               (0x800UL)                 /*!< OST (Bitfield-Mask: 0x01)                             */
#define AUTOTRIM_CR_SRC_Pos               (8UL)                     /*!< SRC (Bit 8)                                           */
#define AUTOTRIM_CR_SRC_Msk               (0x700UL)                 /*!< SRC (Bitfield-Mask: 0x07)                             */
#define AUTOTRIM_CR_PRS_Pos               (4UL)                     /*!< PRS (Bit 4)                                           */
#define AUTOTRIM_CR_PRS_Msk               (0xf0UL)                  /*!< PRS (Bitfield-Mask: 0x0f)                             */
#define AUTOTRIM_CR_AUTO_Pos              (3UL)                     /*!< AUTO (Bit 3)                                          */
#define AUTOTRIM_CR_AUTO_Msk              (0x8UL)                   /*!< AUTO (Bitfield-Mask: 0x01)                            */
#define AUTOTRIM_CR_MD_Pos                (1UL)                     /*!< MD (Bit 1)                                            */
#define AUTOTRIM_CR_MD_Msk                (0x6UL)                   /*!< MD (Bitfield-Mask: 0x03)                              */
#define AUTOTRIM_CR_EN_Pos                (0UL)                     /*!< EN (Bit 0)                                            */
#define AUTOTRIM_CR_EN_Msk                (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  ARR  ========================================================== */
#define AUTOTRIM_ARR_ARR_Pos              (0UL)                     /*!< ARR (Bit 0)                                           */
#define AUTOTRIM_ARR_ARR_Msk              (0xffffUL)                /*!< ARR (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  CNT  ========================================================== */
#define AUTOTRIM_CNT_CNT_Pos              (0UL)                     /*!< CNT (Bit 0)                                           */
#define AUTOTRIM_CNT_CNT_Msk              (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  IER  ========================================================== */
#define AUTOTRIM_IER_MISS_Pos             (5UL)                     /*!< MISS (Bit 5)                                          */
#define AUTOTRIM_IER_MISS_Msk             (0x20UL)                  /*!< MISS (Bitfield-Mask: 0x01)                            */
#define AUTOTRIM_IER_OV_Pos               (4UL)                     /*!< OV (Bit 4)                                            */
#define AUTOTRIM_IER_OV_Msk               (0x10UL)                  /*!< OV (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_IER_UD_Pos               (3UL)                     /*!< UD (Bit 3)                                            */
#define AUTOTRIM_IER_UD_Msk               (0x8UL)                   /*!< UD (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_IER_OK_Pos               (1UL)                     /*!< OK (Bit 1)                                            */
#define AUTOTRIM_IER_OK_Msk               (0x2UL)                   /*!< OK (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_IER_END_Pos              (0UL)                     /*!< END (Bit 0)                                           */
#define AUTOTRIM_IER_END_Msk              (0x1UL)                   /*!< END (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ISR  ========================================================== */
#define AUTOTRIM_ISR_MISS_Pos             (5UL)                     /*!< MISS (Bit 5)                                          */
#define AUTOTRIM_ISR_MISS_Msk             (0x20UL)                  /*!< MISS (Bitfield-Mask: 0x01)                            */
#define AUTOTRIM_ISR_OV_Pos               (4UL)                     /*!< OV (Bit 4)                                            */
#define AUTOTRIM_ISR_OV_Msk               (0x10UL)                  /*!< OV (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_ISR_UD_Pos               (3UL)                     /*!< UD (Bit 3)                                            */
#define AUTOTRIM_ISR_UD_Msk               (0x8UL)                   /*!< UD (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_ISR_OK_Pos               (1UL)                     /*!< OK (Bit 1)                                            */
#define AUTOTRIM_ISR_OK_Msk               (0x2UL)                   /*!< OK (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_ISR_END_Pos              (0UL)                     /*!< END (Bit 0)                                           */
#define AUTOTRIM_ISR_END_Msk              (0x1UL)                   /*!< END (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define AUTOTRIM_ICR_MISS_Pos             (5UL)                     /*!< MISS (Bit 5)                                          */
#define AUTOTRIM_ICR_MISS_Msk             (0x20UL)                  /*!< MISS (Bitfield-Mask: 0x01)                            */
#define AUTOTRIM_ICR_OV_Pos               (4UL)                     /*!< OV (Bit 4)                                            */
#define AUTOTRIM_ICR_OV_Msk               (0x10UL)                  /*!< OV (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_ICR_UD_Pos               (3UL)                     /*!< UD (Bit 3)                                            */
#define AUTOTRIM_ICR_UD_Msk               (0x8UL)                   /*!< UD (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_ICR_OK_Pos               (1UL)                     /*!< OK (Bit 1)                                            */
#define AUTOTRIM_ICR_OK_Msk               (0x2UL)                   /*!< OK (Bitfield-Mask: 0x01)                              */
#define AUTOTRIM_ICR_END_Pos              (0UL)                     /*!< END (Bit 0)                                           */
#define AUTOTRIM_ICR_END_Msk              (0x1UL)                   /*!< END (Bitfield-Mask: 0x01)                             */
/* =========================================================  FCAP  ========================================================== */
#define AUTOTRIM_FCAP_FCAP_Pos            (0UL)                     /*!< FCAP (Bit 0)                                          */
#define AUTOTRIM_FCAP_FCAP_Msk            (0xffffUL)                /*!< FCAP (Bitfield-Mask: 0xffff)                          */
/* =========================================================  TVAL  ========================================================== */
#define AUTOTRIM_TVAL_TVAL_Pos            (0UL)                     /*!< TVAL (Bit 0)                                          */
#define AUTOTRIM_TVAL_TVAL_Msk            (0xffffUL)                /*!< TVAL (Bitfield-Mask: 0xffff)                          */
/* =========================================================  FLIM  ========================================================== */
#define AUTOTRIM_FLIM_FLIM_Pos            (0UL)                     /*!< FLIM (Bit 0)                                          */
#define AUTOTRIM_FLIM_FLIM_Msk            (0xffffUL)                /*!< FLIM (Bitfield-Mask: 0xffff)                          */


/* =========================================================================================================================== */
/* ================                                           BTIM                                            ================ */
/* =========================================================================================================================== */

