qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
/* ==========================================================  CR1  ========================================================== */
#define FLASH_CR1_KEY_Pos                 (16UL)                    /*!< KEY (Bit 16)                                          */
#define FLASH_CR1_KEY_Msk                 (0xffff0000UL)            /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define FLASH_CR1_SECURITY_Pos            (6UL)                     /*!< SECURITY (Bit 6)                                      */
#define FLASH_CR1_SECURITY_Msk            (0xc0UL)                  /*!< SECURITY (Bitfield-Mask: 0x03)                        */
#define FLASH_CR1_BUSY_Pos                (5UL)                     /*!< BUSY (Bit 5)                                          */
#define FLASH_CR1_BUSY_Msk                (0x20UL)                  /*!< BUSY (Bitfield-Mask: 0x01)                            */
#define FLASH_CR1_STANDBY_Pos             (4UL)                     /*!< STANDBY (Bit 4)                                       */
#define FLASH_CR1_STANDBY_Msk             (0x10UL)                  /*!< STANDBY (Bitfield-Mask: 0x01)                         */
#define FLASH_CR1_MODE_Pos                (0UL)                     /*!< MODE (Bit 0)                                          */
#define FLASH_CR1_MODE_Msk                (0x3UL)                   /*!< MODE (Bitfield-Mask: 0x03)                            */
/* ==========================================================  CR2  ========================================================== */
#define FLASH_CR2_KEY_Pos                 (16UL)                    /*!< KEY (Bit 16)                                          */
#define FLASH_CR2_KEY_Msk                 (0xffff0000UL)            /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define FLASH_CR2_WAIT_Pos                (0UL)                     /*!< WAIT (Bit 0)                                          */
#define FLASH_CR2_WAIT_Msk                (0x7UL)                   /*!< WAIT (Bitfield-Mask: 0x07)                            */
/* =======================================================  PAGELOCK1  ======================================================= */
#define FLASH_PAGELOCK1_KEY_Pos           (16UL)                    /*!< KEY (Bit 16)                                          */
#define FLASH_PAGELOCK1_KEY_Msk           (0xffff0000UL)            /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define FLASH_PAGELOCK1_LOCK15_Pos        (15UL)                    /*!< LOCK15 (Bit 15)                                       */
#define FLASH_PAGELOCK1_LOCK15_Msk        (0x8000UL)                /*!< LOCK15 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK1_LOCK14_Pos        (14UL)                    /*!< LOCK14 (Bit 14)                                       */
#define FLASH_PAGELOCK1_LOCK14_Msk        (0x4000UL)                /*!< LOCK14 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK1_LOCK13_Pos        (13UL)                    /*!< LOCK13 (Bit 13)                                       */
#define FLASH_PAGELOCK1_LOCK13_Msk        (0x2000UL)                /*!< LOCK13 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK1_LOCK12_Pos        (12UL)                    /*!< LOCK12 (Bit 12)                                       */
#define FLASH_PAGELOCK1_LOCK12_Msk        (0x1000UL)                /*!< LOCK12 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK1_LOCK11_Pos        (11UL)                    /*!< LOCK11 (Bit 11)                                       */
#define FLASH_PAGELOCK1_LOCK11_Msk        (0x800UL)                 /*!< LOCK11 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK1_LOCK10_Pos        (10UL)                    /*!< LOCK10 (Bit 10)                                       */
#define FLASH_PAGELOCK1_LOCK10_Msk        (0x400UL)                 /*!< LOCK10 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK1_LOCK9_Pos         (9UL)                     /*!< LOCK9 (Bit 9)                                         */
#define FLASH_PAGELOCK1_LOCK9_Msk         (0x200UL)                 /*!< LOCK9 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK8_Pos         (8UL)                     /*!< LOCK8 (Bit 8)                                         */
#define FLASH_PAGELOCK1_LOCK8_Msk         (0x100UL)                 /*!< LOCK8 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK7_Pos         (7UL)                     /*!< LOCK7 (Bit 7)                                         */
#define FLASH_PAGELOCK1_LOCK7_Msk         (0x80UL)                  /*!< LOCK7 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK6_Pos         (6UL)                     /*!< LOCK6 (Bit 6)                                         */
#define FLASH_PAGELOCK1_LOCK6_Msk         (0x40UL)                  /*!< LOCK6 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK5_Pos         (5UL)                     /*!< LOCK5 (Bit 5)                                         */
#define FLASH_PAGELOCK1_LOCK5_Msk         (0x20UL)                  /*!< LOCK5 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK4_Pos         (4UL)                     /*!< LOCK4 (Bit 4)                                         */
#define FLASH_PAGELOCK1_LOCK4_Msk         (0x10UL)                  /*!< LOCK4 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK3_Pos         (3UL)                     /*!< LOCK3 (Bit 3)                                         */
#define FLASH_PAGELOCK1_LOCK3_Msk         (0x8UL)                   /*!< LOCK3 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK2_Pos         (2UL)                     /*!< LOCK2 (Bit 2)                                         */
#define FLASH_PAGELOCK1_LOCK2_Msk         (0x4UL)                   /*!< LOCK2 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK1_Pos         (1UL)                     /*!< LOCK1 (Bit 1)                                         */
#define FLASH_PAGELOCK1_LOCK1_Msk         (0x2UL)                   /*!< LOCK1 (Bitfield-Mask: 0x01)                           */
#define FLASH_PAGELOCK1_LOCK0_Pos         (0UL)                     /*!< LOCK0 (Bit 0)                                         */
#define FLASH_PAGELOCK1_LOCK0_Msk         (0x1UL)                   /*!< LOCK0 (Bitfield-Mask: 0x01)                           */
/* =======================================================  PAGELOCK2  ======================================================= */
#define FLASH_PAGELOCK2_KEY_Pos           (16UL)                    /*!< KEY (Bit 16)                                          */
#define FLASH_PAGELOCK2_KEY_Msk           (0xffff0000UL)            /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define FLASH_PAGELOCK2_LOCK31_Pos        (15UL)                    /*!< LOCK31 (Bit 15)                                       */
#define FLASH_PAGELOCK2_LOCK31_Msk        (0x8000UL)                /*!< LOCK31 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK2_LOCK30_Pos        (14UL)                    /*!< LOCK30 (Bit 14)                                       */
#define FLASH_PAGELOCK2_LOCK30_Msk        (0x4000UL)                /*!< LOCK30 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK2_LOCK29_Pos        (13UL)                    /*!< LOCK29 (Bit 13)                                       */
#define FLASH_PAGELOCK2_LOCK29_Msk        (0x2000UL)                /*!< LOCK29 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK2_LOCK28_Pos        (12UL)                    /*!< LOCK28 (Bit 12)                                       */
#define FLASH_PAGELOCK2_LOCK28_Msk        (0x1000UL)                /*!< LOCK28 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK2_LOCK27_Pos        (11UL)                    /*!< LOCK27 (Bit 11)                                       */
#define FLASH_PAGELOCK2_LOCK27_Msk        (0x800UL)                 /*!< LOCK27 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK2_LOCK26_Pos        (10UL)                    /*!< LOCK26 (Bit 10)                                       */
#define FLASH_PAGELOCK2_LOCK26_Msk        (0x400UL)                 /*!< LOCK26 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK2_LOCK25_Pos        (9UL)                     /*!< LOCK25 (Bit 9)                                        */
#define FLASH_PAGELOCK2_LOCK25_Msk        (0x200UL)                 /*!< LOCK25 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK2_LOCK24_Pos        (8UL)                     /*!< LOCK24 (Bit 8)                                        */
#define FLASH_PAGELOCK2_LOCK24_Msk        (0x100UL)                 /*!< LOCK24 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK2_LOCK23_Pos        (7UL)                     /*!< LOCK23 (Bit 7)                                        */
#define FLASH_PAGELOCK2_LOCK23_Msk        (0x80UL)                  /*!< LOCK23 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK2_LOCK22_Pos        (6UL)                     /*!< LOCK22 (Bit 6)                                        */
#define FLASH_PAGELOCK2_LOCK22_Msk        (0x40UL)                  /*!< LOCK22 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK2_LOCK21_Pos        (5UL)                     /*!< LOCK21 (Bit 5)                                        */
#define FLASH_PAGELOCK2_LOCK21_Msk        (0x20UL)                  /*!< LOCK21 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK2_LOCK20_Pos        (4UL)                     /*!< LOCK20 (Bit 4)                                        */
#define FLASH_PAGELOCK2_LOCK20_Msk        (0x10UL)                  /*!< LOCK20 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK2_LOCK19_Pos        (3UL)                     /*!< LOCK19 (Bit 3)                                        */
#define FLASH_PAGELOCK2_LOCK19_Msk        (0x8UL)                   /*!< LOCK19 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK2_LOCK18_Pos        (2UL)                     /*!< LOCK18 (Bit 2)                                        */
#define FLASH_PAGELOCK2_LOCK18_Msk        (0x4UL)                   /*!< LOCK18 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK2_LOCK17_Pos        (1UL)                     /*!< LOCK17 (Bit 1)                                        */
#define FLASH_PAGELOCK2_LOCK17_Msk        (0x2UL)                   /*!< LOCK17 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK2_LOCK16_Pos        (0UL)                     /*!< LOCK16 (Bit 0)                                        */
#define FLASH_PAGELOCK2_LOCK16_Msk        (0x1UL)                   /*!< LOCK16 (Bitfield-Mask: 0x01)                          */
/* =======================================================  PAGELOCK3  ======================================================= */
#define FLASH_PAGELOCK3_KEY_Pos           (16UL)                    /*!< KEY (Bit 16)                                          */
#define FLASH_PAGELOCK3_KEY_Msk           (0xffff0000UL)            /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define FLASH_PAGELOCK3_LOCK47_Pos        (15UL)                    /*!< LOCK47 (Bit 15)                                       */
#define FLASH_PAGELOCK3_LOCK47_Msk        (0x8000UL)                /*!< LOCK47 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK3_LOCK46_Pos        (14UL)                    /*!< LOCK46 (Bit 14)                                       */
#define FLASH_PAGELOCK3_LOCK46_Msk        (0x4000UL)                /*!< LOCK46 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK3_LOCK45_Pos        (13UL)                    /*!< LOCK45 (Bit 13)                                       */
#define FLASH_PAGELOCK3_LOCK45_Msk        (0x2000UL)                /*!< LOCK45 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK3_LOCK44_Pos        (12UL)                    /*!< LOCK44 (Bit 12)                                       */
#define FLASH_PAGELOCK3_LOCK44_Msk        (0x1000UL)                /*!< LOCK44 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK3_LOCK43_Pos        (11UL)                    /*!< LOCK43 (Bit 11)                                       */
#define FLASH_PAGELOCK3_LOCK43_Msk        (0x800UL)                 /*!< LOCK43 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK3_LOCK42_Pos        (10UL)                    /*!< LOCK42 (Bit 10)                                       */
#define FLASH_PAGELOCK3_LOCK42_Msk        (0x400UL)                 /*!< LOCK42 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK3_LOCK41_Pos        (9UL)                     /*!< LOCK41 (Bit 9)                                        */
#define FLASH_PAGELOCK3_LOCK41_Msk        (0x200UL)                 /*!< LOCK41 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK3_LOCK40_Pos        (8UL)                     /*!< LOCK40 (Bit 8)                                        */
#define FLASH_PAGELOCK3_LOCK40_Msk        (0x100UL)                 /*!< LOCK40 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK3_LOCK39_Pos        (7UL)                     /*!< LOCK39 (Bit 7)                                        */
#define FLASH_PAGELOCK3_LOCK39_Msk        (0x80UL)                  /*!< LOCK39 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK3_LOCK38_Pos        (6UL)                     /*!< LOCK38 (Bit 6)                                        */
#define FLASH_PAGELOCK3_LOCK38_Msk        (0x40UL)                  /*!< LOCK38 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK3_LOCK37_Pos        (5UL)                     /*!< LOCK37 (Bit 5)                                        */
#define FLASH_PAGELOCK3_LOCK37_Msk        (0x20UL)                  /*!< LOCK37 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK3_LOCK36_Pos        (4UL)                     /*!< LOCK36 (Bit 4)                                        */
#define FLASH_PAGELOCK3_LOCK36_Msk        (0x10UL)                  /*!< LOCK36 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK3_LOCK35_Pos        (3UL)                     /*!< LOCK35 (Bit 3)                                        */
#define FLASH_PAGELOCK3_LOCK35_Msk        (0x8UL)                   /*!< LOCK35 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK3_LOCK34_Pos        (2UL)                     /*!< LOCK34 (Bit 2)                                        */
#define FLASH_PAGELOCK3_LOCK34_Msk        (0x4UL)                   /*!< LOCK34 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK3_LOCK33_Pos        (1UL)                     /*!< LOCK33 (Bit 1)                                        */
#define FLASH_PAGELOCK3_LOCK33_Msk        (0x2UL)                   /*!< LOCK33 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK3_LOCK32_Pos        (0UL)                     /*!< LOCK32 (Bit 0)                                        */
#define FLASH_PAGELOCK3_LOCK32_Msk        (0x1UL)                   /*!< LOCK32 (Bitfield-Mask: 0x01)                          */
/* =======================================================  PAGELOCK4  ======================================================= */
#define FLASH_PAGELOCK4_KEY_Pos           (16UL)                    /*!< KEY (Bit 16)                                          */
#define FLASH_PAGELOCK4_KEY_Msk           (0xffff0000UL)            /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define FLASH_PAGELOCK4_LOCK63_Pos        (15UL)                    /*!< LOCK63 (Bit 15)                                       */
#define FLASH_PAGELOCK4_LOCK63_Msk        (0x8000UL)                /*!< LOCK63 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK4_LOCK62_Pos        (14UL)                    /*!< LOCK62 (Bit 14)                                       */
#define FLASH_PAGELOCK4_LOCK62_Msk        (0x4000UL)                /*!< LOCK62 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK4_LOCK61_Pos        (13UL)                    /*!< LOCK61 (Bit 13)                                       */
#define FLASH_PAGELOCK4_LOCK61_Msk        (0x2000UL)                /*!< LOCK61 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK4_LOCK60_Pos        (12UL)                    /*!< LOCK60 (Bit 12)                                       */
#define FLASH_PAGELOCK4_LOCK60_Msk        (0x1000UL)                /*!< LOCK60 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK4_LOCK59_Pos        (11UL)                    /*!< LOCK59 (Bit 11)                                       */
#define FLASH_PAGELOCK4_LOCK59_Msk        (0x800UL)                 /*!< LOCK59 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK4_LOCK58_Pos        (10UL)                    /*!< LOCK58 (Bit 10)                                       */
#define FLASH_PAGELOCK4_LOCK58_Msk        (0x400UL)                 /*!< LOCK58 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK4_LOCK57_Pos        (9UL)                     /*!< LOCK57 (Bit 9)                                        */
#define FLASH_PAGELOCK4_LOCK57_Msk        (0x200UL)                 /*!< LOCK57 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK4_LOCK56_Pos        (8UL)                     /*!< LOCK56 (Bit 8)                                        */
#define FLASH_PAGELOCK4_LOCK56_Msk        (0x100UL)                 /*!< LOCK56 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK4_LOCK55_Pos        (7UL)                     /*!< LOCK55 (Bit 7)                                        */
#define FLASH_PAGELOCK4_LOCK55_Msk        (0x80UL)                  /*!< LOCK55 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK4_LOCK54_Pos        (6UL)                     /*!< LOCK54 (Bit 6)                                        */
#define FLASH_PAGELOCK4_LOCK54_Msk        (0x40UL)                  /*!< LOCK54 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK4_LOCK53_Pos        (5UL)                     /*!< LOCK53 (Bit 5)                                        */
#define FLASH_PAGELOCK4_LOCK53_Msk        (0x20UL)                  /*!< LOCK53 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK4_LOCK52_Pos        (4UL)                     /*!< LOCK52 (Bit 4)                                        */
#define FLASH_PAGELOCK4_LOCK52_Msk        (0x10UL)                  /*!< LOCK52 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK4_LOCK51_Pos        (3UL)                     /*!< LOCK51 (Bit 3)                                        */
#define FLASH_PAGELOCK4_LOCK51_Msk        (0x8UL)                   /*!< LOCK51 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK4_LOCK50_Pos        (2UL)                     /*!< LOCK50 (Bit 2)                                        */
#define FLASH_PAGELOCK4_LOCK50_Msk        (0x4UL)                   /*!< LOCK50 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK4_LOCK49_Pos        (1UL)                     /*!< LOCK49 (Bit 1)                                        */
#define FLASH_PAGELOCK4_LOCK49_Msk        (0x2UL)                   /*!< LOCK49 (Bitfield-Mask: 0x01)                          */
#define FLASH_PAGELOCK4_LOCK48_Pos        (0UL)                     /*!< LOCK48 (Bit 0)                                        */
#define FLASH_PAGELOCK4_LOCK48_Msk        (0x1UL)                   /*!< LOCK48 (Bitfield-Mask: 0x01)                          */
/* ==========================================================  IER  ========================================================== */
#define FLASH_IER_PROG_Pos                (4UL)                     /*!< PROG (Bit 4)                                          */
#define FLASH_IER_PROG_Msk                (0x10UL)                  /*!< PROG (Bitfield-Mask: 0x01)                            */
#define FLASH_IER_PAGELOCK_Pos            (1UL)                     /*!< PAGELOCK (Bit 1)                                      */
#define FLASH_IER_PAGELOCK_Msk            (0x2UL)                   /*!< PAGELOCK (Bitfield-Mask: 0x01)                        */
#define FLASH_IER_PC_Pos                  (0UL)                     /*!< PC (Bit 0)                                            */
#define FLASH_IER_PC_Msk                  (0x1UL)                   /*!< PC (Bitfield-Mask: 0x01)                              */
/* ==========================================================  ISR  ========================================================== */
#define FLASH_ISR_PROG_Pos                (4UL)                     /*!< PROG (Bit 4)                                          */
#define FLASH_ISR_PROG_Msk                (0x10UL)                  /*!< PROG (Bitfield-Mask: 0x01)                            */
#define FLASH_ISR_PAGELOCK_Pos            (1UL)                     /*!< PAGELOCK (Bit 1)                                      */
#define FLASH_ISR_PAGELOCK_Msk            (0x2UL)                   /*!< PAGELOCK (Bitfield-Mask: 0x01)                        */
#define FLASH_ISR_PC_Pos                  (0UL)                     /*!< PC (Bit 0)                                            */
#define FLASH_ISR_PC_Msk                  (0x1UL)                   /*!< PC (Bitfield-Mask: 0x01)                              */
/* ==========================================================  ICR  ========================================================== */
#define FLASH_ICR_PROG_Pos                (4UL)                     /*!< PROG (Bit 4)                                          */
#define FLASH_ICR_PROG_Msk                (0x10UL)                  /*!< PROG (Bitfield-Mask: 0x01)                            */
#define FLASH_ICR_PAGELOCK_Pos            (1UL)                     /*!< PAGELOCK (Bit 1)                                      */
#define FLASH_ICR_PAGELOCK_Msk            (0x2UL)                   /*!< PAGELOCK (Bitfield-Mask: 0x01)                        */
#define FLASH_ICR_PC_Pos                  (0UL)                     /*!< PC (Bit 0)                                            */
#define FLASH_ICR_PC_Msk                  (0x1UL)                   /*!< PC (Bitfield-Mask: 0x01)                              */


/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */

