qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
#define LCD_RAM4_D2_Pos                   (2UL)                     /*!< D2 (Bit 2)                                            */
#define LCD_RAM4_D2_Msk                   (0x4UL)                   /*!< D2 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM4_D1_Pos                   (1UL)                     /*!< D1 (Bit 1)                                            */
#define LCD_RAM4_D1_Msk                   (0x2UL)                   /*!< D1 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM4_D0_Pos                   (0UL)                     /*!< D0 (Bit 0)                                            */
#define LCD_RAM4_D0_Msk                   (0x1UL)                   /*!< D0 (Bitfield-Mask: 0x01)                              */
/* =========================================================  RAM5  ========================================================== */
#define LCD_RAM5_D31_Pos                  (31UL)                    /*!< D31 (Bit 31)                                          */
#define LCD_RAM5_D31_Msk                  (0x80000000UL)            /*!< D31 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D30_Pos                  (30UL)                    /*!< D30 (Bit 30)                                          */
#define LCD_RAM5_D30_Msk                  (0x40000000UL)            /*!< D30 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D29_Pos                  (29UL)                    /*!< D29 (Bit 29)                                          */
#define LCD_RAM5_D29_Msk                  (0x20000000UL)            /*!< D29 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D28_Pos                  (28UL)                    /*!< D28 (Bit 28)                                          */
#define LCD_RAM5_D28_Msk                  (0x10000000UL)            /*!< D28 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D27_Pos                  (27UL)                    /*!< D27 (Bit 27)                                          */
#define LCD_RAM5_D27_Msk                  (0x8000000UL)             /*!< D27 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D26_Pos                  (26UL)                    /*!< D26 (Bit 26)                                          */
#define LCD_RAM5_D26_Msk                  (0x4000000UL)             /*!< D26 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D25_Pos                  (25UL)                    /*!< D25 (Bit 25)                                          */
#define LCD_RAM5_D25_Msk                  (0x2000000UL)             /*!< D25 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D24_Pos                  (24UL)                    /*!< D24 (Bit 24)                                          */
#define LCD_RAM5_D24_Msk                  (0x1000000UL)             /*!< D24 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D23_Pos                  (23UL)                    /*!< D23 (Bit 23)                                          */
#define LCD_RAM5_D23_Msk                  (0x800000UL)              /*!< D23 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D22_Pos                  (22UL)                    /*!< D22 (Bit 22)                                          */
#define LCD_RAM5_D22_Msk                  (0x400000UL)              /*!< D22 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D21_Pos                  (21UL)                    /*!< D21 (Bit 21)                                          */
#define LCD_RAM5_D21_Msk                  (0x200000UL)              /*!< D21 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D20_Pos                  (20UL)                    /*!< D20 (Bit 20)                                          */
#define LCD_RAM5_D20_Msk                  (0x100000UL)              /*!< D20 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D19_Pos                  (19UL)                    /*!< D19 (Bit 19)                                          */
#define LCD_RAM5_D19_Msk                  (0x80000UL)               /*!< D19 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D18_Pos                  (18UL)                    /*!< D18 (Bit 18)                                          */
#define LCD_RAM5_D18_Msk                  (0x40000UL)               /*!< D18 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D17_Pos                  (17UL)                    /*!< D17 (Bit 17)                                          */
#define LCD_RAM5_D17_Msk                  (0x20000UL)               /*!< D17 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D16_Pos                  (16UL)                    /*!< D16 (Bit 16)                                          */
#define LCD_RAM5_D16_Msk                  (0x10000UL)               /*!< D16 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D15_Pos                  (15UL)                    /*!< D15 (Bit 15)                                          */
#define LCD_RAM5_D15_Msk                  (0x8000UL)                /*!< D15 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D14_Pos                  (14UL)                    /*!< D14 (Bit 14)                                          */
#define LCD_RAM5_D14_Msk                  (0x4000UL)                /*!< D14 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D13_Pos                  (13UL)                    /*!< D13 (Bit 13)                                          */
#define LCD_RAM5_D13_Msk                  (0x2000UL)                /*!< D13 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D12_Pos                  (12UL)                    /*!< D12 (Bit 12)                                          */
#define LCD_RAM5_D12_Msk                  (0x1000UL)                /*!< D12 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D11_Pos                  (11UL)                    /*!< D11 (Bit 11)                                          */
#define LCD_RAM5_D11_Msk                  (0x800UL)                 /*!< D11 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D10_Pos                  (10UL)                    /*!< D10 (Bit 10)                                          */
#define LCD_RAM5_D10_Msk                  (0x400UL)                 /*!< D10 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM5_D9_Pos                   (9UL)                     /*!< D9 (Bit 9)                                            */
#define LCD_RAM5_D9_Msk                   (0x200UL)                 /*!< D9 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM5_D8_Pos                   (8UL)                     /*!< D8 (Bit 8)                                            */
#define LCD_RAM5_D8_Msk                   (0x100UL)                 /*!< D8 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM5_D7_Pos                   (7UL)                     /*!< D7 (Bit 7)                                            */
#define LCD_RAM5_D7_Msk                   (0x80UL)                  /*!< D7 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM5_D6_Pos                   (6UL)                     /*!< D6 (Bit 6)                                            */
#define LCD_RAM5_D6_Msk                   (0x40UL)                  /*!< D6 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM5_D5_Pos                   (5UL)                     /*!< D5 (Bit 5)                                            */
#define LCD_RAM5_D5_Msk                   (0x20UL)                  /*!< D5 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM5_D4_Pos                   (4UL)                     /*!< D4 (Bit 4)                                            */
#define LCD_RAM5_D4_Msk                   (0x10UL)                  /*!< D4 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM5_D3_Pos                   (3UL)                     /*!< D3 (Bit 3)                                            */
#define LCD_RAM5_D3_Msk                   (0x8UL)                   /*!< D3 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM5_D2_Pos                   (2UL)                     /*!< D2 (Bit 2)                                            */
#define LCD_RAM5_D2_Msk                   (0x4UL)                   /*!< D2 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM5_D1_Pos                   (1UL)                     /*!< D1 (Bit 1)                                            */
#define LCD_RAM5_D1_Msk                   (0x2UL)                   /*!< D1 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM5_D0_Pos                   (0UL)                     /*!< D0 (Bit 0)                                            */
#define LCD_RAM5_D0_Msk                   (0x1UL)                   /*!< D0 (Bitfield-Mask: 0x01)                              */
/* =========================================================  RAM6  ========================================================== */
#define LCD_RAM6_D31_Pos                  (31UL)                    /*!< D31 (Bit 31)                                          */
#define LCD_RAM6_D31_Msk                  (0x80000000UL)            /*!< D31 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D30_Pos                  (30UL)                    /*!< D30 (Bit 30)                                          */
#define LCD_RAM6_D30_Msk                  (0x40000000UL)            /*!< D30 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D29_Pos                  (29UL)                    /*!< D29 (Bit 29)                                          */
#define LCD_RAM6_D29_Msk                  (0x20000000UL)            /*!< D29 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D28_Pos                  (28UL)                    /*!< D28 (Bit 28)                                          */
#define LCD_RAM6_D28_Msk                  (0x10000000UL)            /*!< D28 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D27_Pos                  (27UL)                    /*!< D27 (Bit 27)                                          */
#define LCD_RAM6_D27_Msk                  (0x8000000UL)             /*!< D27 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D26_Pos                  (26UL)                    /*!< D26 (Bit 26)                                          */
#define LCD_RAM6_D26_Msk                  (0x4000000UL)             /*!< D26 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D25_Pos                  (25UL)                    /*!< D25 (Bit 25)                                          */
#define LCD_RAM6_D25_Msk                  (0x2000000UL)             /*!< D25 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D24_Pos                  (24UL)                    /*!< D24 (Bit 24)                                          */
#define LCD_RAM6_D24_Msk                  (0x1000000UL)             /*!< D24 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D23_Pos                  (23UL)                    /*!< D23 (Bit 23)                                          */
#define LCD_RAM6_D23_Msk                  (0x800000UL)              /*!< D23 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D22_Pos                  (22UL)                    /*!< D22 (Bit 22)                                          */
#define LCD_RAM6_D22_Msk                  (0x400000UL)              /*!< D22 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D21_Pos                  (21UL)                    /*!< D21 (Bit 21)                                          */
#define LCD_RAM6_D21_Msk                  (0x200000UL)              /*!< D21 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D20_Pos                  (20UL)                    /*!< D20 (Bit 20)                                          */
#define LCD_RAM6_D20_Msk                  (0x100000UL)              /*!< D20 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D19_Pos                  (19UL)                    /*!< D19 (Bit 19)                                          */
#define LCD_RAM6_D19_Msk                  (0x80000UL)               /*!< D19 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D18_Pos                  (18UL)                    /*!< D18 (Bit 18)                                          */
#define LCD_RAM6_D18_Msk                  (0x40000UL)               /*!< D18 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D17_Pos                  (17UL)                    /*!< D17 (Bit 17)                                          */
#define LCD_RAM6_D17_Msk                  (0x20000UL)               /*!< D17 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D16_Pos                  (16UL)                    /*!< D16 (Bit 16)                                          */
#define LCD_RAM6_D16_Msk                  (0x10000UL)               /*!< D16 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D15_Pos                  (15UL)                    /*!< D15 (Bit 15)                                          */
#define LCD_RAM6_D15_Msk                  (0x8000UL)                /*!< D15 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D14_Pos                  (14UL)                    /*!< D14 (Bit 14)                                          */
#define LCD_RAM6_D14_Msk                  (0x4000UL)                /*!< D14 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D13_Pos                  (13UL)                    /*!< D13 (Bit 13)                                          */
#define LCD_RAM6_D13_Msk                  (0x2000UL)                /*!< D13 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D12_Pos                  (12UL)                    /*!< D12 (Bit 12)                                          */
#define LCD_RAM6_D12_Msk                  (0x1000UL)                /*!< D12 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D11_Pos                  (11UL)                    /*!< D11 (Bit 11)                                          */
#define LCD_RAM6_D11_Msk                  (0x800UL)                 /*!< D11 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D10_Pos                  (10UL)                    /*!< D10 (Bit 10)                                          */
#define LCD_RAM6_D10_Msk                  (0x400UL)                 /*!< D10 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM6_D9_Pos                   (9UL)                     /*!< D9 (Bit 9)                                            */
#define LCD_RAM6_D9_Msk                   (0x200UL)                 /*!< D9 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM6_D8_Pos                   (8UL)                     /*!< D8 (Bit 8)                                            */
#define LCD_RAM6_D8_Msk                   (0x100UL)                 /*!< D8 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM6_D7_Pos                   (7UL)                     /*!< D7 (Bit 7)                                            */
#define LCD_RAM6_D7_Msk                   (0x80UL)                  /*!< D7 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM6_D6_Pos                   (6UL)                     /*!< D6 (Bit 6)                                            */
#define LCD_RAM6_D6_Msk                   (0x40UL)                  /*!< D6 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM6_D5_Pos                   (5UL)                     /*!< D5 (Bit 5)                                            */
#define LCD_RAM6_D5_Msk                   (0x20UL)                  /*!< D5 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM6_D4_Pos                   (4UL)                     /*!< D4 (Bit 4)                                            */
#define LCD_RAM6_D4_Msk                   (0x10UL)                  /*!< D4 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM6_D3_Pos                   (3UL)                     /*!< D3 (Bit 3)                                            */
#define LCD_RAM6_D3_Msk                   (0x8UL)                   /*!< D3 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM6_D2_Pos                   (2UL)                     /*!< D2 (Bit 2)                                            */
#define LCD_RAM6_D2_Msk                   (0x4UL)                   /*!< D2 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM6_D1_Pos                   (1UL)                     /*!< D1 (Bit 1)                                            */
#define LCD_RAM6_D1_Msk                   (0x2UL)                   /*!< D1 (Bitfield-Mask: 0x01)                              */
#define LCD_RAM6_D0_Pos                   (0UL)                     /*!< D0 (Bit 0)                                            */
#define LCD_RAM6_D0_Msk                   (0x1UL)                   /*!< D0 (Bitfield-Mask: 0x01)                              */
/* =========================================================  RAM7  ========================================================== */
#define LCD_RAM7_D31_Pos                  (31UL)                    /*!< D31 (Bit 31)                                          */
#define LCD_RAM7_D31_Msk                  (0x80000000UL)            /*!< D31 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D30_Pos                  (30UL)                    /*!< D30 (Bit 30)                                          */
#define LCD_RAM7_D30_Msk                  (0x40000000UL)            /*!< D30 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D29_Pos                  (29UL)                    /*!< D29 (Bit 29)                                          */
#define LCD_RAM7_D29_Msk                  (0x20000000UL)            /*!< D29 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D28_Pos                  (28UL)                    /*!< D28 (Bit 28)                                          */
#define LCD_RAM7_D28_Msk                  (0x10000000UL)            /*!< D28 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D27_Pos                  (27UL)                    /*!< D27 (Bit 27)                                          */
#define LCD_RAM7_D27_Msk                  (0x8000000UL)             /*!< D27 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D26_Pos                  (26UL)                    /*!< D26 (Bit 26)                                          */
#define LCD_RAM7_D26_Msk                  (0x4000000UL)             /*!< D26 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D25_Pos                  (25UL)                    /*!< D25 (Bit 25)                                          */
#define LCD_RAM7_D25_Msk                  (0x2000000UL)             /*!< D25 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D24_Pos                  (24UL)                    /*!< D24 (Bit 24)                                          */
#define LCD_RAM7_D24_Msk                  (0x1000000UL)             /*!< D24 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D23_Pos                  (23UL)                    /*!< D23 (Bit 23)                                          */
#define LCD_RAM7_D23_Msk                  (0x800000UL)              /*!< D23 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D22_Pos                  (22UL)                    /*!< D22 (Bit 22)                                          */
#define LCD_RAM7_D22_Msk                  (0x400000UL)              /*!< D22 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D21_Pos                  (21UL)                    /*!< D21 (Bit 21)                                          */
#define LCD_RAM7_D21_Msk                  (0x200000UL)              /*!< D21 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D20_Pos                  (20UL)                    /*!< D20 (Bit 20)                                          */
#define LCD_RAM7_D20_Msk                  (0x100000UL)              /*!< D20 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D19_Pos                  (19UL)                    /*!< D19 (Bit 19)                                          */
#define LCD_RAM7_D19_Msk                  (0x80000UL)               /*!< D19 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D18_Pos                  (18UL)                    /*!< D18 (Bit 18)                                          */
#define LCD_RAM7_D18_Msk                  (0x40000UL)               /*!< D18 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D17_Pos                  (17UL)                    /*!< D17 (Bit 17)                                          */
#define LCD_RAM7_D17_Msk                  (0x20000UL)               /*!< D17 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D16_Pos                  (16UL)                    /*!< D16 (Bit 16)                                          */
#define LCD_RAM7_D16_Msk                  (0x10000UL)               /*!< D16 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D15_Pos                  (15UL)                    /*!< D15 (Bit 15)                                          */
#define LCD_RAM7_D15_Msk                  (0x8000UL)                /*!< D15 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D14_Pos                  (14UL)                    /*!< D14 (Bit 14)                                          */
#define LCD_RAM7_D14_Msk                  (0x4000UL)                /*!< D14 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D13_Pos                  (13UL)                    /*!< D13 (Bit 13)                                          */
#define LCD_RAM7_D13_Msk                  (0x2000UL)                /*!< D13 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D12_Pos                  (12UL)                    /*!< D12 (Bit 12)                                          */
#define LCD_RAM7_D12_Msk                  (0x1000UL)                /*!< D12 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D11_Pos                  (11UL)                    /*!< D11 (Bit 11)                                          */
#define LCD_RAM7_D11_Msk                  (0x800UL)                 /*!< D11 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D10_Pos                  (10UL)                    /*!< D10 (Bit 10)                                          */
#define LCD_RAM7_D10_Msk                  (0x400UL)                 /*!< D10 (Bitfield-Mask: 0x01)                             */
#define LCD_RAM7_D9_Pos                   (9UL)                     /*!< D9 (Bit 9)                                            */
#define LCD_RAM7_D9_Msk                   (0x200UL)                 /*!< D9 (Bitfield-Mask: 0x01)                              */
