qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
#define SYSCTRL_AHBEN_FLASH_Msk           (0x2UL)                   /*!< FLASH (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBEN_DMA_Pos             (0UL)                     /*!< DMA (Bit 0)                                           */
#define SYSCTRL_AHBEN_DMA_Msk             (0x1UL)                   /*!< DMA (Bitfield-Mask: 0x01)                             */
/* ========================================================  APBEN1  ========================================================= */
#define SYSCTRL_APBEN1_LPTIM_Pos          (15UL)                    /*!< LPTIM (Bit 15)                                        */
#define SYSCTRL_APBEN1_LPTIM_Msk          (0x8000UL)                /*!< LPTIM (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_LCD_Pos            (13UL)                    /*!< LCD (Bit 13)                                          */
#define SYSCTRL_APBEN1_LCD_Msk            (0x2000UL)                /*!< LCD (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_APBEN1_I2C2_Pos           (12UL)                    /*!< I2C2 (Bit 12)                                         */
#define SYSCTRL_APBEN1_I2C2_Msk           (0x1000UL)                /*!< I2C2 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN1_I2C1_Pos           (11UL)                    /*!< I2C1 (Bit 11)                                         */
#define SYSCTRL_APBEN1_I2C1_Msk           (0x800UL)                 /*!< I2C1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN1_UART5_Pos          (10UL)                    /*!< UART5 (Bit 10)                                        */
#define SYSCTRL_APBEN1_UART5_Msk          (0x400UL)                 /*!< UART5 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_UART4_Pos          (9UL)                     /*!< UART4 (Bit 9)                                         */
#define SYSCTRL_APBEN1_UART4_Msk          (0x200UL)                 /*!< UART4 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_UART3_Pos          (8UL)                     /*!< UART3 (Bit 8)                                         */
#define SYSCTRL_APBEN1_UART3_Msk          (0x100UL)                 /*!< UART3 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_UART2_Pos          (7UL)                     /*!< UART2 (Bit 7)                                         */
#define SYSCTRL_APBEN1_UART2_Msk          (0x80UL)                  /*!< UART2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_SPI2_Pos           (6UL)                     /*!< SPI2 (Bit 6)                                          */
#define SYSCTRL_APBEN1_SPI2_Msk           (0x40UL)                  /*!< SPI2 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN1_IWDT_Pos           (5UL)                     /*!< IWDT (Bit 5)                                          */
#define SYSCTRL_APBEN1_IWDT_Msk           (0x20UL)                  /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN1_WWDT_Pos           (4UL)                     /*!< WWDT (Bit 4)                                          */
#define SYSCTRL_APBEN1_WWDT_Msk           (0x10UL)                  /*!< WWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN1_RTC_Pos            (3UL)                     /*!< RTC (Bit 3)                                           */
#define SYSCTRL_APBEN1_RTC_Msk            (0x8UL)                   /*!< RTC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_APBEN1_GTIM2_Pos          (2UL)                     /*!< GTIM2 (Bit 2)                                         */
#define SYSCTRL_APBEN1_GTIM2_Msk          (0x4UL)                   /*!< GTIM2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_GTIM1_Pos          (1UL)                     /*!< GTIM1 (Bit 1)                                         */
#define SYSCTRL_APBEN1_GTIM1_Msk          (0x2UL)                   /*!< GTIM1 (Bitfield-Mask: 0x01)                           */
/* ========================================================  APBEN2  ========================================================= */
#define SYSCTRL_APBEN2_AUTOTRIM_Pos       (13UL)                    /*!< AUTOTRIM (Bit 13)                                     */
#define SYSCTRL_APBEN2_AUTOTRIM_Msk       (0x2000UL)                /*!< AUTOTRIM (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_APBEN2_BTIM_Pos           (12UL)                    /*!< BTIM (Bit 12)                                         */
#define SYSCTRL_APBEN2_BTIM_Msk           (0x1000UL)                /*!< BTIM (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN2_GTIM4_Pos          (11UL)                    /*!< GTIM4 (Bit 11)                                        */
#define SYSCTRL_APBEN2_GTIM4_Msk          (0x800UL)                 /*!< GTIM4 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN2_GTIM3_Pos          (10UL)                    /*!< GTIM3 (Bit 10)                                        */
#define SYSCTRL_APBEN2_GTIM3_Msk          (0x400UL)                 /*!< GTIM3 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN2_UART1_Pos          (9UL)                     /*!< UART1 (Bit 9)                                         */
#define SYSCTRL_APBEN2_UART1_Msk          (0x200UL)                 /*!< UART1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN2_SPI1_Pos           (8UL)                     /*!< SPI1 (Bit 8)                                          */
#define SYSCTRL_APBEN2_SPI1_Msk           (0x100UL)                 /*!< SPI1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN2_ATIM_Pos           (7UL)                     /*!< ATIM (Bit 7)                                          */
#define SYSCTRL_APBEN2_ATIM_Msk           (0x80UL)                  /*!< ATIM (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN2_VC_Pos             (4UL)                     /*!< VC (Bit 4)                                            */
#define SYSCTRL_APBEN2_VC_Msk             (0x10UL)                  /*!< VC (Bitfield-Mask: 0x01)                              */
#define SYSCTRL_APBEN2_ADC_Pos            (2UL)                     /*!< ADC (Bit 2)                                           */
#define SYSCTRL_APBEN2_ADC_Msk            (0x4UL)                   /*!< ADC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_APBEN2_UART6_Pos          (1UL)                     /*!< UART6 (Bit 1)                                         */
#define SYSCTRL_APBEN2_UART6_Msk          (0x2UL)                   /*!< UART6 (Bitfield-Mask: 0x01)                           */
/* ========================================================  AHBRST  ========================================================= */
#define SYSCTRL_AHBRST_AES_Pos            (11UL)                    /*!< AES (Bit 11)                                          */
#define SYSCTRL_AHBRST_AES_Msk            (0x800UL)                 /*!< AES (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_AHBRST_TRNG_Pos           (10UL)                    /*!< TRNG (Bit 10)                                         */
#define SYSCTRL_AHBRST_TRNG_Msk           (0x400UL)                 /*!< TRNG (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_AHBRST_GPIOF_Pos          (9UL)                     /*!< GPIOF (Bit 9)                                         */
#define SYSCTRL_AHBRST_GPIOF_Msk          (0x200UL)                 /*!< GPIOF (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_GPIOE_Pos          (8UL)                     /*!< GPIOE (Bit 8)                                         */
#define SYSCTRL_AHBRST_GPIOE_Msk          (0x100UL)                 /*!< GPIOE (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_GPIOD_Pos          (7UL)                     /*!< GPIOD (Bit 7)                                         */
#define SYSCTRL_AHBRST_GPIOD_Msk          (0x80UL)                  /*!< GPIOD (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_GPIOC_Pos          (6UL)                     /*!< GPIOC (Bit 6)                                         */
#define SYSCTRL_AHBRST_GPIOC_Msk          (0x40UL)                  /*!< GPIOC (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_GPIOB_Pos          (5UL)                     /*!< GPIOB (Bit 5)                                         */
#define SYSCTRL_AHBRST_GPIOB_Msk          (0x20UL)                  /*!< GPIOB (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_GPIOA_Pos          (4UL)                     /*!< GPIOA (Bit 4)                                         */
#define SYSCTRL_AHBRST_GPIOA_Msk          (0x10UL)                  /*!< GPIOA (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_CRC_Pos            (2UL)                     /*!< CRC (Bit 2)                                           */
#define SYSCTRL_AHBRST_CRC_Msk            (0x4UL)                   /*!< CRC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_AHBRST_FLASH_Pos          (1UL)                     /*!< FLASH (Bit 1)                                         */
#define SYSCTRL_AHBRST_FLASH_Msk          (0x2UL)                   /*!< FLASH (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_DMA_Pos            (0UL)                     /*!< DMA (Bit 0)                                           */
#define SYSCTRL_AHBRST_DMA_Msk            (0x1UL)                   /*!< DMA (Bitfield-Mask: 0x01)                             */
/* ========================================================  APBRST1  ======================================================== */
#define SYSCTRL_APBRST1_LPTIM_Pos         (15UL)                    /*!< LPTIM (Bit 15)                                        */
#define SYSCTRL_APBRST1_LPTIM_Msk         (0x8000UL)                /*!< LPTIM (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_LCD_Pos           (13UL)                    /*!< LCD (Bit 13)                                          */
#define SYSCTRL_APBRST1_LCD_Msk           (0x2000UL)                /*!< LCD (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_APBRST1_I2C2_Pos          (12UL)                    /*!< I2C2 (Bit 12)                                         */
#define SYSCTRL_APBRST1_I2C2_Msk          (0x1000UL)                /*!< I2C2 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_I2C1_Pos          (11UL)                    /*!< I2C1 (Bit 11)                                         */
#define SYSCTRL_APBRST1_I2C1_Msk          (0x800UL)                 /*!< I2C1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_UART5_Pos         (10UL)                    /*!< UART5 (Bit 10)                                        */
#define SYSCTRL_APBRST1_UART5_Msk         (0x400UL)                 /*!< UART5 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_UART4_Pos         (9UL)                     /*!< UART4 (Bit 9)                                         */
#define SYSCTRL_APBRST1_UART4_Msk         (0x200UL)                 /*!< UART4 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_UART3_Pos         (8UL)                     /*!< UART3 (Bit 8)                                         */
#define SYSCTRL_APBRST1_UART3_Msk         (0x100UL)                 /*!< UART3 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_UART2_Pos         (7UL)                     /*!< UART2 (Bit 7)                                         */
#define SYSCTRL_APBRST1_UART2_Msk         (0x80UL)                  /*!< UART2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_SPI2_Pos          (6UL)                     /*!< SPI2 (Bit 6)                                          */
#define SYSCTRL_APBRST1_SPI2_Msk          (0x40UL)                  /*!< SPI2 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_IWDT_Pos          (5UL)                     /*!< IWDT (Bit 5)                                          */
#define SYSCTRL_APBRST1_IWDT_Msk          (0x20UL)                  /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_WWDT_Pos          (4UL)                     /*!< WWDT (Bit 4)                                          */
#define SYSCTRL_APBRST1_WWDT_Msk          (0x10UL)                  /*!< WWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_RTC_Pos           (3UL)                     /*!< RTC (Bit 3)                                           */
#define SYSCTRL_APBRST1_RTC_Msk           (0x8UL)                   /*!< RTC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_APBRST1_GTIM2_Pos         (2UL)                     /*!< GTIM2 (Bit 2)                                         */
#define SYSCTRL_APBRST1_GTIM2_Msk         (0x4UL)                   /*!< GTIM2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_GTIM1_Pos         (1UL)                     /*!< GTIM1 (Bit 1)                                         */
#define SYSCTRL_APBRST1_GTIM1_Msk         (0x2UL)                   /*!< GTIM1 (Bitfield-Mask: 0x01)                           */
/* ========================================================  APBRST2  ======================================================== */
#define SYSCTRL_APBRST2_AUTOTRIM_Pos      (13UL)                    /*!< AUTOTRIM (Bit 13)                                     */
#define SYSCTRL_APBRST2_AUTOTRIM_Msk      (0x2000UL)                /*!< AUTOTRIM (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_APBRST2_BTIM_Pos          (12UL)                    /*!< BTIM (Bit 12)                                         */
#define SYSCTRL_APBRST2_BTIM_Msk          (0x1000UL)                /*!< BTIM (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST2_GTIM4_Pos         (11UL)                    /*!< GTIM4 (Bit 11)                                        */
#define SYSCTRL_APBRST2_GTIM4_Msk         (0x800UL)                 /*!< GTIM4 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST2_GTIM3_Pos         (10UL)                    /*!< GTIM3 (Bit 10)                                        */
#define SYSCTRL_APBRST2_GTIM3_Msk         (0x400UL)                 /*!< GTIM3 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST2_UART1_Pos         (9UL)                     /*!< UART1 (Bit 9)                                         */
#define SYSCTRL_APBRST2_UART1_Msk         (0x200UL)                 /*!< UART1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST2_SPI1_Pos          (8UL)                     /*!< SPI1 (Bit 8)                                          */
#define SYSCTRL_APBRST2_SPI1_Msk          (0x100UL)                 /*!< SPI1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST2_ATIM_Pos          (7UL)                     /*!< ATIM (Bit 7)                                          */
#define SYSCTRL_APBRST2_ATIM_Msk          (0x80UL)                  /*!< ATIM (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST2_VC_Pos            (4UL)                     /*!< VC (Bit 4)                                            */
#define SYSCTRL_APBRST2_VC_Msk            (0x10UL)                  /*!< VC (Bitfield-Mask: 0x01)                              */
#define SYSCTRL_APBRST2_ADC_Pos           (2UL)                     /*!< ADC (Bit 2)                                           */
#define SYSCTRL_APBRST2_ADC_Msk           (0x4UL)                   /*!< ADC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_APBRST2_UART6_Pos         (1UL)                     /*!< UART6 (Bit 1)                                         */
#define SYSCTRL_APBRST2_UART6_Msk         (0x2UL)                   /*!< UART6 (Bitfield-Mask: 0x01)                           */
/* =======================================================  RESETFLAG  ======================================================= */
#define SYSCTRL_RESETFLAG_SYSRESETREQ_Pos (9UL)                     /*!< SYSRESETREQ (Bit 9)                                   */
#define SYSCTRL_RESETFLAG_SYSRESETREQ_Msk (0x200UL)                 /*!< SYSRESETREQ (Bitfield-Mask: 0x01)                     */
#define SYSCTRL_RESETFLAG_LOCKUP_Pos      (8UL)                     /*!< LOCKUP (Bit 8)                                        */
#define SYSCTRL_RESETFLAG_LOCKUP_Msk      (0x100UL)                 /*!< LOCKUP (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_RESETFLAG_RSTB_Pos        (6UL)                     /*!< RSTB (Bit 6)                                          */
#define SYSCTRL_RESETFLAG_RSTB_Msk        (0x40UL)                  /*!< RSTB (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_RESETFLAG_WWDT_Pos        (5UL)                     /*!< WWDT (Bit 5)                                          */
#define SYSCTRL_RESETFLAG_WWDT_Msk        (0x20UL)                  /*!< WWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_RESETFLAG_IWDT_Pos        (4UL)                     /*!< IWDT (Bit 4)                                          */
#define SYSCTRL_RESETFLAG_IWDT_Msk        (0x10UL)                  /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_RESETFLAG_LVD_Pos         (3UL)                     /*!< LVD (Bit 3)                                           */
#define SYSCTRL_RESETFLAG_LVD_Msk         (0x8UL)                   /*!< LVD (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_RESETFLAG_POR_Pos         (0UL)                     /*!< POR (Bit 0)                                           */
#define SYSCTRL_RESETFLAG_POR_Msk         (0x1UL)                   /*!< POR (Bitfield-Mask: 0x01)                             */
/* =========================================================  DEBUG  ========================================================= */
#define SYSCTRL_DEBUG_LPTIM_Pos           (11UL)                    /*!< LPTIM (Bit 11)                                        */
#define SYSCTRL_DEBUG_LPTIM_Msk           (0x800UL)                 /*!< LPTIM (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_WWDT_Pos            (10UL)                    /*!< WWDT (Bit 10)                                         */
#define SYSCTRL_DEBUG_WWDT_Msk            (0x400UL)                 /*!< WWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_DEBUG_IWDT_Pos            (9UL)                     /*!< IWDT (Bit 9)                                          */
#define SYSCTRL_DEBUG_IWDT_Msk            (0x200UL)                 /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_DEBUG_RTC_Pos             (8UL)                     /*!< RTC (Bit 8)                                           */
#define SYSCTRL_DEBUG_RTC_Msk             (0x100UL)                 /*!< RTC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_DEBUG_AUTOTRIM_Pos        (6UL)                     /*!< AUTOTRIM (Bit 6)                                      */
#define SYSCTRL_DEBUG_AUTOTRIM_Msk        (0x40UL)                  /*!< AUTOTRIM (Bitfield-Mask: 0x01)                        */
#define SYSCTRL_DEBUG_BTIM123_Pos         (5UL)                     /*!< BTIM123 (Bit 5)                                       */
#define SYSCTRL_DEBUG_BTIM123_Msk         (0x20UL)                  /*!< BTIM123 (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_DEBUG_GTIM4_Pos           (4UL)                     /*!< GTIM4 (Bit 4)                                         */
#define SYSCTRL_DEBUG_GTIM4_Msk           (0x10UL)                  /*!< GTIM4 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_GTIM3_Pos           (3UL)                     /*!< GTIM3 (Bit 3)                                         */
#define SYSCTRL_DEBUG_GTIM3_Msk           (0x8UL)                   /*!< GTIM3 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_GTIM2_Pos           (2UL)                     /*!< GTIM2 (Bit 2)                                         */
#define SYSCTRL_DEBUG_GTIM2_Msk           (0x4UL)                   /*!< GTIM2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_GTIM1_Pos           (1UL)                     /*!< GTIM1 (Bit 1)                                         */
#define SYSCTRL_DEBUG_GTIM1_Msk           (0x2UL)                   /*!< GTIM1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_ATIM_Pos            (0UL)                     /*!< ATIM (Bit 0)                                          */
#define SYSCTRL_DEBUG_ATIM_Msk            (0x1UL)                   /*!< ATIM (Bitfield-Mask: 0x01)                            */
/* =======================================================  GTIM1CAP  ======================================================== */
#define SYSCTRL_GTIM1CAP_CH4_Pos          (12UL)                    /*!< CH4 (Bit 12)                                          */
#define SYSCTRL_GTIM1CAP_CH4_Msk          (0x7000UL)                /*!< CH4 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM1CAP_CH3_Pos          (8UL)                     /*!< CH3 (Bit 8)                                           */
#define SYSCTRL_GTIM1CAP_CH3_Msk          (0x700UL)                 /*!< CH3 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM1CAP_CH2_Pos          (4UL)                     /*!< CH2 (Bit 4)                                           */
#define SYSCTRL_GTIM1CAP_CH2_Msk          (0x70UL)                  /*!< CH2 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM1CAP_CH1_Pos          (0UL)                     /*!< CH1 (Bit 0)                                           */
#define SYSCTRL_GTIM1CAP_CH1_Msk          (0x7UL)                   /*!< CH1 (Bitfield-Mask: 0x07)                             */
/* =======================================================  GTIM2CAP  ======================================================== */
#define SYSCTRL_GTIM2CAP_CH4_Pos          (12UL)                    /*!< CH4 (Bit 12)                                          */
#define SYSCTRL_GTIM2CAP_CH4_Msk          (0x7000UL)                /*!< CH4 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM2CAP_CH3_Pos          (8UL)                     /*!< CH3 (Bit 8)                                           */
#define SYSCTRL_GTIM2CAP_CH3_Msk          (0x700UL)                 /*!< CH3 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM2CAP_CH2_Pos          (4UL)                     /*!< CH2 (Bit 4)                                           */
#define SYSCTRL_GTIM2CAP_CH2_Msk          (0x70UL)                  /*!< CH2 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM2CAP_CH1_Pos          (0UL)                     /*!< CH1 (Bit 0)                                           */
#define SYSCTRL_GTIM2CAP_CH1_Msk          (0x7UL)                   /*!< CH1 (Bitfield-Mask: 0x07)                             */
/* =======================================================  GTIM3CAP  ======================================================== */
