qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083.h
#define SYSCTRL_GTIM3CAP_CH4_Pos          (12UL)                    /*!< CH4 (Bit 12)                                          */
#define SYSCTRL_GTIM3CAP_CH4_Msk          (0x7000UL)                /*!< CH4 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM3CAP_CH3_Pos          (8UL)                     /*!< CH3 (Bit 8)                                           */
#define SYSCTRL_GTIM3CAP_CH3_Msk          (0x700UL)                 /*!< CH3 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM3CAP_CH2_Pos          (4UL)                     /*!< CH2 (Bit 4)                                           */
#define SYSCTRL_GTIM3CAP_CH2_Msk          (0x70UL)                  /*!< CH2 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM3CAP_CH1_Pos          (0UL)                     /*!< CH1 (Bit 0)                                           */
#define SYSCTRL_GTIM3CAP_CH1_Msk          (0x7UL)                   /*!< CH1 (Bitfield-Mask: 0x07)                             */
/* =======================================================  GTIM4CAP  ======================================================== */
#define SYSCTRL_GTIM4CAP_CH4_Pos          (12UL)                    /*!< CH4 (Bit 12)                                          */
#define SYSCTRL_GTIM4CAP_CH4_Msk          (0x7000UL)                /*!< CH4 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM4CAP_CH3_Pos          (8UL)                     /*!< CH3 (Bit 8)                                           */
#define SYSCTRL_GTIM4CAP_CH3_Msk          (0x700UL)                 /*!< CH3 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM4CAP_CH2_Pos          (4UL)                     /*!< CH2 (Bit 4)                                           */
#define SYSCTRL_GTIM4CAP_CH2_Msk          (0x70UL)                  /*!< CH2 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM4CAP_CH1_Pos          (0UL)                     /*!< CH1 (Bit 0)                                           */
#define SYSCTRL_GTIM4CAP_CH1_Msk          (0x7UL)                   /*!< CH1 (Bitfield-Mask: 0x07)                             */
/* ========================================================  ATIMETR  ======================================================== */
#define SYSCTRL_ATIMETR_ATIMETR_Pos       (0UL)                     /*!< ATIMETR (Bit 0)                                       */
#define SYSCTRL_ATIMETR_ATIMETR_Msk       (0x7UL)                   /*!< ATIMETR (Bitfield-Mask: 0x07)                         */
/* ========================================================  GTIMETR  ======================================================== */
#define SYSCTRL_GTIMETR_GTIM4ETR_Pos      (12UL)                    /*!< GTIM4ETR (Bit 12)                                     */
#define SYSCTRL_GTIMETR_GTIM4ETR_Msk      (0x7000UL)                /*!< GTIM4ETR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_GTIMETR_GTIM3ETR_Pos      (8UL)                     /*!< GTIM3ETR (Bit 8)                                      */
#define SYSCTRL_GTIMETR_GTIM3ETR_Msk      (0x700UL)                 /*!< GTIM3ETR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_GTIMETR_GTIM2ETR_Pos      (4UL)                     /*!< GTIM2ETR (Bit 4)                                      */
#define SYSCTRL_GTIMETR_GTIM2ETR_Msk      (0x70UL)                  /*!< GTIM2ETR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_GTIMETR_GTIM1ETR_Pos      (0UL)                     /*!< GTIM1ETR (Bit 0)                                      */
#define SYSCTRL_GTIMETR_GTIM1ETR_Msk      (0x7UL)                   /*!< GTIM1ETR (Bitfield-Mask: 0x07)                        */
/* ========================================================  TIMITR  ========================================================= */
#define SYSCTRL_TIMITR_BTIM3ITR_Pos       (21UL)                    /*!< BTIM3ITR (Bit 21)                                     */
#define SYSCTRL_TIMITR_BTIM3ITR_Msk       (0xe00000UL)              /*!< BTIM3ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_BTIM2ITR_Pos       (18UL)                    /*!< BTIM2ITR (Bit 18)                                     */
#define SYSCTRL_TIMITR_BTIM2ITR_Msk       (0x1c0000UL)              /*!< BTIM2ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_BTIM1ITR_Pos       (15UL)                    /*!< BTIM1ITR (Bit 15)                                     */
#define SYSCTRL_TIMITR_BTIM1ITR_Msk       (0x38000UL)               /*!< BTIM1ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_GTIM4ITR_Pos       (12UL)                    /*!< GTIM4ITR (Bit 12)                                     */
#define SYSCTRL_TIMITR_GTIM4ITR_Msk       (0x7000UL)                /*!< GTIM4ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_GTIM3ITR_Pos       (9UL)                     /*!< GTIM3ITR (Bit 9)                                      */
#define SYSCTRL_TIMITR_GTIM3ITR_Msk       (0xe00UL)                 /*!< GTIM3ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_GTIM2ITR_Pos       (6UL)                     /*!< GTIM2ITR (Bit 6)                                      */
#define SYSCTRL_TIMITR_GTIM2ITR_Msk       (0x1c0UL)                 /*!< GTIM2ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_GTIM1ITR_Pos       (3UL)                     /*!< GTIM1ITR (Bit 3)                                      */
#define SYSCTRL_TIMITR_GTIM1ITR_Msk       (0x38UL)                  /*!< GTIM1ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_ATIMITR_Pos        (0UL)                     /*!< ATIMITR (Bit 0)                                       */
#define SYSCTRL_TIMITR_ATIMITR_Msk        (0x7UL)                   /*!< ATIMITR (Bitfield-Mask: 0x07)                         */
/* ==========================================================  MCO  ========================================================== */
#define SYSCTRL_MCO_DIV_Pos               (4UL)                     /*!< DIV (Bit 4)                                           */
#define SYSCTRL_MCO_DIV_Msk               (0x70UL)                  /*!< DIV (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_MCO_SOURCE_Pos            (0UL)                     /*!< SOURCE (Bit 0)                                        */
#define SYSCTRL_MCO_SOURCE_Msk            (0xfUL)                   /*!< SOURCE (Bitfield-Mask: 0x0f)                          */
/* =========================================================  IRMOD  ========================================================= */
#define SYSCTRL_IRMOD_MOD_Pos             (0UL)                     /*!< MOD (Bit 0)                                           */
#define SYSCTRL_IRMOD_MOD_Msk             (0xfUL)                   /*!< MOD (Bitfield-Mask: 0x0f)                             */


/* =========================================================================================================================== */
/* ================                                           TRNG                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR1  ========================================================== */
#define TRNG_CR1_START_Pos                (1UL)                     /*!< START (Bit 1)                                         */
#define TRNG_CR1_START_Msk                (0x2UL)                   /*!< START (Bitfield-Mask: 0x01)                           */
#define TRNG_CR1_EN_Pos                   (0UL)                     /*!< EN (Bit 0)                                            */
#define TRNG_CR1_EN_Msk                   (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CR2  ========================================================== */
#define TRNG_CR2_SHIFT_Pos                (2UL)                     /*!< SHIFT (Bit 2)                                         */
#define TRNG_CR2_SHIFT_Msk                (0x1cUL)                  /*!< SHIFT (Bitfield-Mask: 0x07)                           */
#define TRNG_CR2_SOURCE_Pos               (0UL)                     /*!< SOURCE (Bit 0)                                        */
#define TRNG_CR2_SOURCE_Msk               (0x3UL)                   /*!< SOURCE (Bitfield-Mask: 0x03)                          */
/* =========================================================  DATA0  ========================================================= */
#define TRNG_DATA0_DATA0_Pos              (0UL)                     /*!< DATA0 (Bit 0)                                         */
#define TRNG_DATA0_DATA0_Msk              (0xffffffffUL)            /*!< DATA0 (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  DATA1  ========================================================= */
#define TRNG_DATA1_DATA1_Pos              (0UL)                     /*!< DATA1 (Bit 0)                                         */
#define TRNG_DATA1_DATA1_Msk              (0xffffffffUL)            /*!< DATA1 (Bitfield-Mask: 0xffffffff)                     */


/* =========================================================================================================================== */
/* ================                                           UART                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR1  ========================================================== */
#define UARTx_CR1_OVER_Pos                (9UL)                     /*!< OVER (Bit 9)                                          */
#define UARTx_CR1_OVER_Msk                (0x600UL)                 /*!< OVER (Bitfield-Mask: 0x03)                            */
#define UARTx_CR1_START_Pos               (8UL)                     /*!< START (Bit 8)                                         */
#define UARTx_CR1_START_Msk               (0x100UL)                 /*!< START (Bitfield-Mask: 0x01)                           */
#define UARTx_CR1_SYNC_Pos                (6UL)                     /*!< SYNC (Bit 6)                                          */
#define UARTx_CR1_SYNC_Msk                (0x40UL)                  /*!< SYNC (Bitfield-Mask: 0x01)                            */
#define UARTx_CR1_STOP_Pos                (4UL)                     /*!< STOP (Bit 4)                                          */
#define UARTx_CR1_STOP_Msk                (0x30UL)                  /*!< STOP (Bitfield-Mask: 0x03)                            */
#define UARTx_CR1_PARITY_Pos              (2UL)                     /*!< PARITY (Bit 2)                                        */
#define UARTx_CR1_PARITY_Msk              (0xcUL)                   /*!< PARITY (Bitfield-Mask: 0x03)                          */
#define UARTx_CR1_RXEN_Pos                (1UL)                     /*!< RXEN (Bit 1)                                          */
#define UARTx_CR1_RXEN_Msk                (0x2UL)                   /*!< RXEN (Bitfield-Mask: 0x01)                            */
#define UARTx_CR1_TXEN_Pos                (0UL)                     /*!< TXEN (Bit 0)                                          */
#define UARTx_CR1_TXEN_Msk                (0x1UL)                   /*!< TXEN (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CR2  ========================================================== */
#define UARTx_CR2_SOURCE_Pos              (8UL)                     /*!< SOURCE (Bit 8)                                         */
#define UARTx_CR2_SOURCE_Msk              (0x300UL)                 /*!< SOURCE (Bitfield-Mask: 0x03)                           */
#define UARTx_CR2_DMATX_Pos               (7UL)                     /*!< DMATX (Bit 7)                                         */
#define UARTx_CR2_DMATX_Msk               (0x80UL)                  /*!< DMATX (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_DMARX_Pos               (6UL)                     /*!< DMARX (Bit 6)                                         */
#define UARTx_CR2_DMARX_Msk               (0x40UL)                  /*!< DMARX (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_TXINV_Pos               (5UL)                     /*!< TXINV (Bit 5)                                         */
#define UARTx_CR2_TXINV_Msk               (0x20UL)                  /*!< TXINV (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_RXINV_Pos               (4UL)                     /*!< RXINV (Bit 4)                                         */
#define UARTx_CR2_RXINV_Msk               (0x10UL)                  /*!< RXINV (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_RTSEN_Pos               (3UL)                     /*!< RTSEN (Bit 3)                                         */
#define UARTx_CR2_RTSEN_Msk               (0x8UL)                   /*!< RTSEN (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_CTSEN_Pos               (2UL)                     /*!< CTSEN (Bit 2)                                         */
#define UARTx_CR2_CTSEN_Msk               (0x4UL)                   /*!< CTSEN (Bitfield-Mask: 0x01)                           */
#define UARTx_CR2_SIGNAL_Pos              (1UL)                     /*!< SIGNAL (Bit 1)                                        */
#define UARTx_CR2_SIGNAL_Msk              (0x2UL)                   /*!< SIGNAL (Bitfield-Mask: 0x01)                          */
#define UARTx_CR2_ADDREN_Pos              (0UL)                     /*!< ADDREN (Bit 0)                                        */
#define UARTx_CR2_ADDREN_Msk              (0x1UL)                   /*!< ADDREN (Bitfield-Mask: 0x01)                          */
/* =========================================================  BRRI  ========================================================== */
#define UARTx_BRRI_BRRI_Pos               (0UL)                     /*!< BRRI (Bit 0)                                          */
#define UARTx_BRRI_BRRI_Msk               (0xffffUL)                /*!< BRRI (Bitfield-Mask: 0xffff)                          */
/* =========================================================  BRRF  ========================================================== */
#define UARTx_BRRF_BRRF_Pos               (0UL)                     /*!< BRRF (Bit 0)                                          */
#define UARTx_BRRF_BRRF_Msk               (0xfUL)                   /*!< BRRF (Bitfield-Mask: 0x0f)                            */
/* ==========================================================  TDR  ========================================================== */
#define UARTx_TDR_TDR_Pos                 (0UL)                     /*!< TDR (Bit 0)                                           */
#define UARTx_TDR_TDR_Msk                 (0x1ffUL)                 /*!< TDR (Bitfield-Mask: 0x1ff)                            */
/* ==========================================================  RDR  ========================================================== */
#define UARTx_RDR_RDR_Pos                 (0UL)                     /*!< RDR (Bit 0)                                           */
#define UARTx_RDR_RDR_Msk                 (0x1ffUL)                 /*!< RDR (Bitfield-Mask: 0x1ff)                            */
/* ==========================================================  IER  ========================================================== */
#define UARTx_IER_CTS_Pos                 (6UL)                     /*!< CTS (Bit 6)                                           */
#define UARTx_IER_CTS_Msk                 (0x40UL)                  /*!< CTS (Bitfield-Mask: 0x01)                             */
#define UARTx_IER_PE_Pos                  (4UL)                     /*!< PE (Bit 4)                                            */
#define UARTx_IER_PE_Msk                  (0x10UL)                  /*!< PE (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_FE_Pos                  (3UL)                     /*!< FE (Bit 3)                                            */
#define UARTx_IER_FE_Msk                  (0x8UL)                   /*!< FE (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_RC_Pos                  (2UL)                     /*!< RC (Bit 2)                                            */
#define UARTx_IER_RC_Msk                  (0x4UL)                   /*!< RC (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_TC_Pos                  (1UL)                     /*!< TC (Bit 1)                                            */
#define UARTx_IER_TC_Msk                  (0x2UL)                   /*!< TC (Bitfield-Mask: 0x01)                              */
#define UARTx_IER_TXE_Pos                 (0UL)                     /*!< TXE (Bit 0)                                           */
#define UARTx_IER_TXE_Msk                 (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ISR  ========================================================== */
#define UARTx_ISR_TXBUSY_Pos              (8UL)                     /*!< TXBUSY (Bit 8)                                        */
#define UARTx_ISR_TXBUSY_Msk              (0x100UL)                 /*!< TXBUSY (Bitfield-Mask: 0x01)                          */
#define UARTx_ISR_CTSLV_Pos               (7UL)                     /*!< CTSLV (Bit 7)                                         */
#define UARTx_ISR_CTSLV_Msk               (0x80UL)                  /*!< CTSLV (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_CTS_Pos                 (6UL)                     /*!< CTS (Bit 6)                                           */
#define UARTx_ISR_CTS_Msk                 (0x40UL)                  /*!< CTS (Bitfield-Mask: 0x01)                             */
#define UARTx_ISR_MATCH_Pos               (5UL)                     /*!< MATCH (Bit 5)                                         */
#define UARTx_ISR_MATCH_Msk               (0x20UL)                  /*!< MATCH (Bitfield-Mask: 0x01)                           */
#define UARTx_ISR_PE_Pos                  (4UL)                     /*!< PE (Bit 4)                                            */
#define UARTx_ISR_PE_Msk                  (0x10UL)                  /*!< PE (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_FE_Pos                  (3UL)                     /*!< FE (Bit 3)                                            */
#define UARTx_ISR_FE_Msk                  (0x8UL)                   /*!< FE (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_RC_Pos                  (2UL)                     /*!< RC (Bit 2)                                            */
#define UARTx_ISR_RC_Msk                  (0x4UL)                   /*!< RC (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_TC_Pos                  (1UL)                     /*!< TC (Bit 1)                                            */
#define UARTx_ISR_TC_Msk                  (0x2UL)                   /*!< TC (Bitfield-Mask: 0x01)                              */
#define UARTx_ISR_TXE_Pos                 (0UL)                     /*!< TXE (Bit 0)                                           */
#define UARTx_ISR_TXE_Msk                 (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define UARTx_ICR_CTS_Pos                 (6UL)                     /*!< CTS (Bit 6)                                           */
#define UARTx_ICR_CTS_Msk                 (0x40UL)                  /*!< CTS (Bitfield-Mask: 0x01)                             */
#define UARTx_ICR_PE_Pos                  (4UL)                     /*!< PE (Bit 4)                                            */
#define UARTx_ICR_PE_Msk                  (0x10UL)                  /*!< PE (Bitfield-Mask: 0x01)                              */
#define UARTx_ICR_FE_Pos                  (3UL)                     /*!< FE (Bit 3)                                            */
#define UARTx_ICR_FE_Msk                  (0x8UL)                   /*!< FE (Bitfield-Mask: 0x01)                              */
#define UARTx_ICR_RC_Pos                  (2UL)                     /*!< RC (Bit 2)                                            */
#define UARTx_ICR_RC_Msk                  (0x4UL)                   /*!< RC (Bitfield-Mask: 0x01)                              */
#define UARTx_ICR_TC_Pos                  (1UL)                     /*!< TC (Bit 1)                                            */
#define UARTx_ICR_TC_Msk                  (0x2UL)                   /*!< TC (Bitfield-Mask: 0x01)                              */
/* =========================================================  ADDR  ========================================================== */
#define UARTx_ADDR_ADDR_Pos               (0UL)                     /*!< ADDR (Bit 0)                                          */
#define UARTx_ADDR_ADDR_Msk               (0xffUL)                  /*!< ADDR (Bitfield-Mask: 0xff)                            */
/* =========================================================  MASK  ========================================================== */
#define UARTx_MASK_MASK_Pos               (0UL)                     /*!< MASK (Bit 0)                                          */
#define UARTx_MASK_MASK_Msk               (0xffUL)                  /*!< MASK (Bitfield-Mask: 0xff)                            */


/* =========================================================================================================================== */
/* ================                                            VC                                             ================ */
/* =========================================================================================================================== */

